[
  {
    "title": "U.S. Lawmakers Are Driving International Visitors Away – And Tourism Is Paying the Price",
    "summary": "Brand USA is being asked to promote a destination undermined by U.S. government policies on equality, funding, and border treatment. As Canadian and global travelers quietly turn away, eTurboNews calls on U.S....",
    "url": "https://eturbonews.com/us-lawmakers-driving-tourism-decline-brand-usa-crisis/",
    "source": "eTurboNews",
    "category": "Romania",
    "date": "February 05, 2026"
  },
  {
    "title": "Grand Hotel Leicester Reopens as Unlimited Collection Gem to Revitalize UK Tourism",
    "summary": "Grand Hotel Leicester Reopens as Unlimited Collection Gem to Revitalize UK Tourism Leicester's Grand Hotel reopens January 2026 as Unlimited Collection property, blending heritage with luxury to boost city tourism...",
    "url": "https://www.travelandtourworld.com/news/article/leicester-grand-hotel-reopens-as-unlimited-collection-gem-to-revitalize-city-tourism/",
    "source": "Travel & Tour World",
    "category": "European Tourism",
    "date": "February 07, 2026"
  },
  {
    "title": "Antigua and Barbuda Puts Sustainability and People at the Center of Its 2026 Tourism Strategy",
    "summary": "Antigua and Barbuda has outlined a people-first tourism strategy for 2026, focusing on sustainable growth, major hotel investments, cruise expansion, and improved air access. Tourism Minister Charles Fernandez said...",
    "url": "https://eturbonews.com/antigua-barbuda-tourism-strategy-2026/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "February 04, 2026"
  },
  {
    "title": "Accor’s Message to Sofitel Owners: ‘Renovate, Rebrand, or Exit’",
    "summary": "Accor, the Paris-based hospitality company, is continuing a sweeping renovation campaign at Sofitel, its largest luxury hotel brand.",
    "url": "https://skift.com/2026/02/05/accors-message-to-sofitel-owners-renovate-rebrand-or-exit/",
    "source": "Skift",
    "category": "Romania",
    "date": "February 05, 2026"
  },
  {
    "title": "Orient Express Reveals Mediterranean Two-Yacht Fleet Deployment to Elevate Luxury Tourism in 2027",
    "summary": "Orient Express Reveals Mediterranean Two-Yacht Fleet Deployment to Elevate Luxury Tourism in 2027 Mediterranean, Adriatic, Greece shine as Orient Express deploys Corinthian, Olympian yachts in 2027, transforming...",
    "url": "https://www.travelandtourworld.com/news/article/orient-express-reveals-mediterranean-two-yacht-fleet-deployment-to-elevate-luxury-tourism-in-2027/",
    "source": "Travel & Tour World",
    "category": "European Tourism",
    "date": "February 07, 2026"
  },
  {
    "title": "Major Tourism Investment Signals Economic Shift in The Gambia",
    "summary": "A major beachfront tourism investment in Tanji signals a potential turning point for The Gambia’s economy. The project is expected to boost employment, attract international visitors, and elevate West Africa’s...",
    "url": "https://eturbonews.com/gambia-tourism-investment-economic-impact/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "February 04, 2026"
  },
  {
    "title": "Wizz Air carries 14.5 million passengers in Romania in 2025 as local operations expand",
    "summary": "Wizz Air transported around 14.5 million passengers to and from Romania in 2025, up 13.1% compared to the previous year, as the airline strengthened its presence on the local market. According to the company, Romania...",
    "url": "https://www.romania-insider.com/wizz-air-passengers-romania-2025",
    "source": "Romania Insider",
    "category": "Romania",
    "date": "February 06, 2026"
  },
  {
    "title": "The Advantages of Launching a Business in Germany",
    "summary": "As one of the largest economies in the world, Germany is without a doubt one of the best countries to do business in. Economic stability, excellent infrastructure, and trade cooperation with nations worldwide are...",
    "url": "https://www.romania-insider.com/advantages-launching-business-germany",
    "source": "Romania Insider",
    "category": "European Tourism",
    "date": "February 06, 2026"
  },
  {
    "title": "Destinations International Releases Landmark Report Linking Canada’s Visitor Economy to Export Growth",
    "summary": "Destinations International (DI) today announced the release of The Impact of the Visitor Economy on Canadian Exports , a new research report developed with EY-Parthenon that explores the potential connection between...",
    "url": "https://eturbonews.com/destinations-international-releases-landmark-report-linking-canadas-visitor-economy-to-export-growth/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "February 05, 2026"
  }
]