[
  {
    "title": "New Mercure hotel opens in central Bucharest",
    "summary": "Mercure Hotels & Resorts has opened Mercure Bucharest Cantemir, a new hotel located in central Bucharest, within walking distance of Unirii Square, the Old Town, and Tineretului Park. The opening further expands...",
    "url": "https://www.romania-insider.com/mercure-bucharest-cantemir-opening-2026",
    "source": "Romania Insider",
    "category": "Romania",
    "date": "January 30, 2026"
  },
  {
    "title": "Travel and Eat: The Global Race for Culinary Dominance Is Reshaping Tourism",
    "summary": "Culinary tourism is transforming global travel as cities compete to become food capitals. From Rome and Seoul to Lima and Dubai, gastronomy is driving economic growth, cultural preservation, and destination...",
    "url": "https://eturbonews.com/global-race-culinary-capital-tourism/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "January 30, 2026"
  },
  {
    "title": "Mexico’s Cultural Renaissance: Archaeological Sites and Museums See Record 21.4 Million Visitors",
    "summary": "Mexico’s Cultural Renaissance: Archaeological Sites and Museums See Record 21.4 Million Visitors Discover why Mexico’s cultural tourism is booming. With 21.4 million visitors in 2025, explore the rise of Chichén...",
    "url": "https://www.travelandtourworld.com/news/article/mexicos-cultural-renaissance-archaeological-sites-and-museums-see-record-21-4-million-visitors/",
    "source": "Travel & Tour World",
    "category": "Global Travel",
    "date": "February 01, 2026"
  },
  {
    "title": "ME by Meliá and Lacoste Unite in Fashion-Forward Hospitality Collaboration",
    "summary": "ME by Meliá, the contemporary lifestyle brand of Meliá Hotels International, has partnered with Lacoste in a collaboration that blends hospitality, fashion and design. The alliance goes beyond aesthetics, reflecting...",
    "url": "https://eturbonews.com/me-by-melia-lacoste-collaboration/",
    "source": "eTurboNews",
    "category": "Romania",
    "date": "January 29, 2026"
  },
  {
    "title": "Costa Navarino Launches 2026 Season with a Phased Resort Reopenings, Strengthening their Hospitality Growth Through Wellness, Gastronomy, Sports and Culture in Greece",
    "summary": "Costa Navarino Launches 2026 Season with a Phased Resort Reopenings, Strengthening their Hospitality Growth Through Wellness, Gastronomy, Sports and Culture in Greece Costa Navarino opens its 2026 season with phased...",
    "url": "https://www.travelandtourworld.com/news/article/costa-navarino-launches-2026-season-with-a-phased-resort-reopenings-strengthening-their-hospitality-growth-through-wellness-gastronomy-sports-and-culture-in-greece/",
    "source": "Travel & Tour World",
    "category": "European Tourism",
    "date": "February 01, 2026"
  },
  {
    "title": "WTTC Warns Proposed US ESTA Changes Could Further Damage International Tourism to the United States",
    "summary": "The World Travel & Tourism Council warns that proposed US ESTA changes could further damage inbound tourism, adding to the impact of Trump-era travel policies. The World Tourism Network says entry bans, higher visa...",
    "url": "https://eturbonews.com/wttc-warns-us-esta-changes-damage-tourism/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "January 29, 2026"
  },
  {
    "title": "LVMH CEO: ‘Vuitton’s Not Going to Go Into the Hotel Business’",
    "summary": "LVMH CEO Bernard Arnault said there won't be a Louis Vuitton Hotels brand, despite online speculation to the contrary. He said he wanted to keep the retail brand 'focused, not diversified.'",
    "url": "https://skift.com/2026/01/30/lvmh-ceo-vuittons-not-going-to-go-into-the-hotel-business/",
    "source": "Skift",
    "category": "Romania",
    "date": "January 30, 2026"
  },
  {
    "title": "Morocco’s Tourism Boom: Record Revenues, Global Appeal, and the Road Ahead",
    "summary": "Morocco’s tourism industry reached a historic milestone in 2025, generating record revenues of MAD 138 billion. Driven by strong European demand and expanding new markets, the sector is boosting economic growth while...",
    "url": "https://eturbonews.com/morocco-tourism-growth-record-revenue-2025/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "January 31, 2026"
  },
  {
    "title": "World Travel & Tourism Council Blind Spots and the Rise of a Quiet Tourism Revolution",
    "summary": "As World Travel & Tourism Council champions scalable, profit-driven tourism led by global corporations, UN World Tourism Organization focuses on development and inclusion. Between them, the World Tourism Network...",
    "url": "https://eturbonews.com/wttc-blind-spots-quiet-tourism-revolution/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "January 31, 2026"
  }
]