[
  {
    "title": "U.S. Lawmakers Are Driving International Visitors Away – And Tourism Is Paying the Price",
    "summary": "Brand USA is being asked to promote a destination undermined by U.S. government policies on equality, funding, and border treatment. As Canadian and global travelers quietly turn away, eTurboNews calls on U.S....",
    "url": "https://eturbonews.com/us-lawmakers-driving-tourism-decline-brand-usa-crisis/",
    "source": "eTurboNews",
    "category": "Romania",
    "date": "February 05, 2026"
  },
  {
    "title": "2026’s Most Jaw-Dropping Student Travel Deal: Discover Why Germany and Norway Are the Go-To Tuition-Free Destinations!",
    "summary": "2026’s Most Jaw-Dropping Student Travel Deal: Discover Why Germany and Norway Are the Go-To Tuition-Free Destinations! Explore how Germany and Norway’s tuition-free universities are boosting international student...",
    "url": "https://www.travelandtourworld.com/news/article/2026s-most-jaw-dropping-student-travel-deal-discover-why-germany-and-norway-are-the-go-to-tuition-free-destinations/",
    "source": "Travel & Tour World",
    "category": "European Tourism",
    "date": "February 07, 2026"
  },
  {
    "title": "Antigua and Barbuda Puts Sustainability and People at the Center of Its 2026 Tourism Strategy",
    "summary": "Antigua and Barbuda has outlined a people-first tourism strategy for 2026, focusing on sustainable growth, major hotel investments, cruise expansion, and improved air access. Tourism Minister Charles Fernandez said...",
    "url": "https://eturbonews.com/antigua-barbuda-tourism-strategy-2026/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "February 04, 2026"
  },
  {
    "title": "Antigua and Barbuda Showcases Culture, Cuisine and 2026 Experiences at Leading UK Travel Exhibition",
    "summary": "The Antigua and Barbuda Tourism Authority showcased the twin-island destination at the Destinations: Holiday and Travel Show in London, engaging UK travellers with insights into 2026 events, vibrant culture and...",
    "url": "https://eturbonews.com/antigua-barbuda-tourism-authority-destinations-travel-show-london/",
    "source": "eTurboNews",
    "category": "Romania",
    "date": "February 05, 2026"
  },
  {
    "title": "UK’s Flooding Crisis: Ninety-One Warnings Cause Major Disruptions to Travel and Tourism Across England and Wales, Know More",
    "summary": "UK’s Flooding Crisis: Ninety-One Warnings Cause Major Disruptions to Travel and Tourism Across England and Wales, Know More Flood warnings across the UK impact transportation and tourism, with road closures, rail...",
    "url": "https://www.travelandtourworld.com/news/article/uks-flooding-crisis-ninety-one-warnings-cause-major-disruptions-to-travel-and-tourism-across-england-and-wales-know-more/",
    "source": "Travel & Tour World",
    "category": "European Tourism",
    "date": "February 07, 2026"
  },
  {
    "title": "Gabala: Azerbaijan’s New Hub for International Music and Cultural Tourism",
    "summary": "Gabala: Azerbaijan’s New Hub for International Music and Cultural Tourism 2nd “Winter Tale” International Music Festival kicks off in Gabala, Azerbaijan, offering a rich cultural experience that combines music,...",
    "url": "https://www.travelandtourworld.com/news/article/gabala-azerbaijans-new-hub-for-international-music-and-cultural-tourism/",
    "source": "Travel & Tour World",
    "category": "Global Travel",
    "date": "February 07, 2026"
  },
  {
    "title": "Accor’s Message to Sofitel Owners: ‘Renovate, Rebrand, or Exit’",
    "summary": "Accor, the Paris-based hospitality company, is continuing a sweeping renovation campaign at Sofitel, its largest luxury hotel brand.",
    "url": "https://skift.com/2026/02/05/accors-message-to-sofitel-owners-renovate-rebrand-or-exit/",
    "source": "Skift",
    "category": "Romania",
    "date": "February 05, 2026"
  },
  {
    "title": "The Advantages of Launching a Business in Germany",
    "summary": "As one of the largest economies in the world, Germany is without a doubt one of the best countries to do business in. Economic stability, excellent infrastructure, and trade cooperation with nations worldwide are...",
    "url": "https://www.romania-insider.com/advantages-launching-business-germany",
    "source": "Romania Insider",
    "category": "European Tourism",
    "date": "February 06, 2026"
  },
  {
    "title": "Major Tourism Investment Signals Economic Shift in The Gambia",
    "summary": "A major beachfront tourism investment in Tanji signals a potential turning point for The Gambia’s economy. The project is expected to boost employment, attract international visitors, and elevate West Africa’s...",
    "url": "https://eturbonews.com/gambia-tourism-investment-economic-impact/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "February 04, 2026"
  }
]