[
  {
    "title": "OpenAI Launches Ads Pilot for ChatGPT, Travel Expected to Participate",
    "summary": "OpenAI has crossed the advertising threshold. ChatGPT is now a potential marketing channel for travel brands — one that could surface hotel and flight ads at the exact moment a traveler is planning a trip inside a...",
    "url": "https://skift.com/2026/02/09/openai-chatgpt-ad-pilot-launch-travel/",
    "source": "Skift",
    "category": "Romania",
    "date": "February 09, 2026"
  },
  {
    "title": "Scotland Opens a Resort Dedicated to Whisky — Surprisingly, It’s Not About Getting Drunk",
    "summary": "Scotland’s Speyside is preparing to welcome the world’s first luxury whisky resort, blending distilling heritage with high-end hospitality. Far from a drinking playground, the resort focuses on culture,...",
    "url": "https://eturbonews.com/scotland-world-first-luxury-whisky-resort-speyside/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "February 09, 2026"
  },
  {
    "title": "DOLE Invests One Million Pesos to Boost Puerto Princesa’s Buenavista Eco-Tourism, Creating Sustainable Jobs and Local Tourism Growth",
    "summary": "DOLE Invests One Million Pesos to Boost Puerto Princesa’s Buenavista Eco-Tourism, Creating Sustainable Jobs and Local Tourism Growth DOLE’s one million pesos assistance boosts the Buenavista Bangus Eco-Tourism...",
    "url": "https://www.travelandtourworld.com/news/article/dole-invests-one-million-pesos-to-boost-puerto-princesas-buenavista-eco-tourism-creating-sustainable-jobs-and-local-tourism-growth/",
    "source": "Travel & Tour World",
    "category": "Global Travel",
    "date": "February 10, 2026"
  },
  {
    "title": "Budget Hotels Are Struggling. Wyndham’s CEO Sees Opportunity",
    "summary": "Wyndham holds about 30% of all U.S. branded economy hotels. CEO Geoff Ballotti said in an exclusive Skift interview that he's optimistic for the budget segment, despite the recent cost and demand pressures it's faced.",
    "url": "https://skift.com/2026/02/09/budget-hotels-are-struggling-wyndhams-ceo-sees-opportunity/",
    "source": "Skift",
    "category": "Romania",
    "date": "February 09, 2026"
  },
  {
    "title": "Europe vs. the USA in 2026: Why the “Trump Factor” Is Becoming a Real Tourism Liability",
    "summary": "As long-haul travel tightens in 2026, politics is no longer background noise. From renewed U.S. policy uncertainty to the fallout of the Trump Tower Belgrade controversy, the “Trump factor” is reshaping traveler...",
    "url": "https://eturbonews.com/europe-usa-travel-2026-trump-factor-tourism/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "February 09, 2026"
  },
  {
    "title": "One Thousand ALG Travel Advisors Sign-Up to Volunteer in Support of Jamaica",
    "summary": "Jamaica’s Minister of Tourism, Hon Edmund Bartlett, has warmly applauded the 1,000 travel advisors from Apple Leisure Group (ALG) who have signed up to participate in volunteer initiatives across the island,...",
    "url": "https://eturbonews.com/alg-travel-advisor-volunteer-for-jamaica/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "February 09, 2026"
  },
  {
    "title": "Quiet as the new luxury: A residential community is redefining urban living in Bucharest",
    "summary": "For many years, Bucharest’s real estate story was simple: closer to the center meant better. Noise, traffic, and density were accepted as part of city life, almost as proof that you had “made it.” Today, many are...",
    "url": "https://www.romania-insider.com/quiet-new-luxury-residential-community-redefining-urban-living-bucharest",
    "source": "Romania Insider",
    "category": "Romania",
    "date": "February 09, 2026"
  },
  {
    "title": "Bulgarians Travel More, Farther, and Longer: How Destinations Can Win a Growing Market",
    "summary": "Despite having the EU’s lowest average disposable income, Bulgarians are traveling abroad more than ever. In 2026, they are choosing longer holidays, farther destinations, and increasingly cruises. For destinations,...",
    "url": "https://eturbonews.com/bulgarian-outbound-travel-market-2026/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "February 07, 2026"
  },
  {
    "title": "Flights to St Helena Suspended, Leaving Remote Island Cut Off Again",
    "summary": "Commercial flights to St Helena have been suspended after safety certification issues grounded the island’s only regular air service. Operated by Airlink , the route is a vital lifeline for residents, tourism, and...",
    "url": "https://eturbonews.com/st-helena-flights-suspended-airlink-airport-safety/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "February 09, 2026"
  }
]