[
  {
    "title": "New Mercure hotel opens in central Bucharest",
    "summary": "Mercure Hotels & Resorts has opened Mercure Bucharest Cantemir, a new hotel located in central Bucharest, within walking distance of Unirii Square, the Old Town, and Tineretului Park. The opening further expands...",
    "url": "https://www.romania-insider.com/mercure-bucharest-cantemir-opening-2026",
    "source": "Romania Insider",
    "category": "Romania",
    "date": "January 30, 2026"
  },
  {
    "title": "World Tourism Network to Host First ITB Berlin Networking Dinner on Eve of ITB 2026",
    "summary": "The World Tourism Network will host its first ITB Berlin Networking Dinner on March 2, 2026, at Alpha House. Organized with the International Institute for Peace Through Tourism , the African Tourism Board , and...",
    "url": "https://eturbonews.com/world-tourism-network-itb-berlin-networking-dinner-2026/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "February 01, 2026"
  },
  {
    "title": "WTTC Warns Proposed US ESTA Changes Could Further Damage International Tourism to the United States",
    "summary": "The World Travel & Tourism Council warns that proposed US ESTA changes could further damage inbound tourism, adding to the impact of Trump-era travel policies. The World Tourism Network says entry bans, higher visa...",
    "url": "https://eturbonews.com/wttc-warns-us-esta-changes-damage-tourism/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "January 29, 2026"
  },
  {
    "title": "ME by Meliá and Lacoste Unite in Fashion-Forward Hospitality Collaboration",
    "summary": "ME by Meliá, the contemporary lifestyle brand of Meliá Hotels International, has partnered with Lacoste in a collaboration that blends hospitality, fashion and design. The alliance goes beyond aesthetics, reflecting...",
    "url": "https://eturbonews.com/me-by-melia-lacoste-collaboration/",
    "source": "eTurboNews",
    "category": "Romania",
    "date": "January 29, 2026"
  },
  {
    "title": "Travel and Eat: The Global Race for Culinary Dominance Is Reshaping Tourism",
    "summary": "Culinary tourism is transforming global travel as cities compete to become food capitals. From Rome and Seoul to Lima and Dubai, gastronomy is driving economic growth, cultural preservation, and destination...",
    "url": "https://eturbonews.com/global-race-culinary-capital-tourism/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "January 30, 2026"
  },
  {
    "title": "Quy Nhon Secures ASEAN Clean Tourist City Award 2026, Strengthening Tourism Growth, Destination Appeal and Sustainable Travel in Vietnam",
    "summary": "Quy Nhon Secures ASEAN Clean Tourist City Award 2026, Strengthening Tourism Growth, Destination Appeal and Sustainable Travel in Vietnam Quy Nhon wins the ASEAN Clean Tourist City Award 2026, reinforcing sustainable...",
    "url": "https://www.travelandtourworld.com/news/article/quy-nhon-secures-asean-clean-tourist-city-award-2026-strengthening-tourism-growth-destination-appeal-and-sustainable-travel-in-vietnam/",
    "source": "Travel & Tour World",
    "category": "Global Travel",
    "date": "February 02, 2026"
  },
  {
    "title": "Celebrate Irish Culture with Music, Dance, and Storytelling at A Taste of Ireland",
    "summary": "Celebrate Irish Culture with Music, Dance, and Storytelling at A Taste of Ireland Don’t miss A Taste of Ireland on February 15, 2026, at Alabama Theatre in Birmingham! Experience vibrant Irish music, dance, and...",
    "url": "https://www.travelandtourworld.com/news/article/celebrate-irish-culture-with-music-dance-and-storytelling-at-a-taste-of-ireland/",
    "source": "Travel & Tour World",
    "category": "Romania",
    "date": "February 02, 2026"
  },
  {
    "title": "Morocco’s Tourism Boom: Record Revenues, Global Appeal, and the Road Ahead",
    "summary": "Morocco’s tourism industry reached a historic milestone in 2025, generating record revenues of MAD 138 billion. Driven by strong European demand and expanding new markets, the sector is boosting economic growth while...",
    "url": "https://eturbonews.com/morocco-tourism-growth-record-revenue-2025/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "January 31, 2026"
  },
  {
    "title": "Horn of Africa leaders inaugurate Shabeely Resort, betting on tourism in eastern Ethiopia’s Somali Region",
    "summary": "The inauguration of Shabeely Resort in Ethiopia’s Somali Region marks a strategic effort to unlock tourism in a historically underdeveloped area. Positioned near Jigjiga, the resort highlights growing infrastructure,...",
    "url": "https://eturbonews.com/shabeely-resort-ethiopia-somali-region-tourism/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "February 01, 2026"
  }
]