[
  {
    "title": "U.S. Lawmakers Are Driving International Visitors Away – And Tourism Is Paying the Price",
    "summary": "Brand USA is being asked to promote a destination undermined by U.S. government policies on equality, funding, and border treatment. As Canadian and global travelers quietly turn away, eTurboNews calls on U.S....",
    "url": "https://eturbonews.com/us-lawmakers-driving-tourism-decline-brand-usa-crisis/",
    "source": "eTurboNews",
    "category": "Romania",
    "date": "February 05, 2026"
  },
  {
    "title": "Dusit Hotels Charts European Push as It Looks to Export Thai Hospitality Beyond Asia",
    "summary": "Competing for attention in Europe, one of the world’s most crowded hotel markets, Dusit’s size could work in its favor. However, the challenge would be to translate Thai hospitality into a European context without...",
    "url": "https://skift.com/2026/02/05/dusit-hotels-charts-european-push-as-it-looks-to-export-thai-hospitality-beyond-asia/",
    "source": "Skift",
    "category": "European Tourism",
    "date": "February 05, 2026"
  },
  {
    "title": "Antigua and Barbuda Puts Sustainability and People at the Center of Its 2026 Tourism Strategy",
    "summary": "Antigua and Barbuda has outlined a people-first tourism strategy for 2026, focusing on sustainable growth, major hotel investments, cruise expansion, and improved air access. Tourism Minister Charles Fernandez said...",
    "url": "https://eturbonews.com/antigua-barbuda-tourism-strategy-2026/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "February 04, 2026"
  },
  {
    "title": "Antigua and Barbuda Showcases Culture, Cuisine and 2026 Experiences at Leading UK Travel Exhibition",
    "summary": "The Antigua and Barbuda Tourism Authority showcased the twin-island destination at the Destinations: Holiday and Travel Show in London, engaging UK travellers with insights into 2026 events, vibrant culture and...",
    "url": "https://eturbonews.com/antigua-barbuda-tourism-authority-destinations-travel-show-london/",
    "source": "eTurboNews",
    "category": "Romania",
    "date": "February 05, 2026"
  },
  {
    "title": "Spain Emerges as World’s Tourism Powerhouse — Madrid Declared Global Tourism Capital",
    "summary": "Spain has reinforced its status as a global tourism leader after welcoming nearly 97 million international visitors , generating record revenues. With Madrid hosting both UN Tourism and the WTTC headquarters , the...",
    "url": "https://eturbonews.com/spain-tourism-records-madrid-global-tourism-capital/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "February 04, 2026"
  },
  {
    "title": "Major Tourism Investment Signals Economic Shift in The Gambia",
    "summary": "A major beachfront tourism investment in Tanji signals a potential turning point for The Gambia’s economy. The project is expected to boost employment, attract international visitors, and elevate West Africa’s...",
    "url": "https://eturbonews.com/gambia-tourism-investment-economic-impact/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "February 04, 2026"
  },
  {
    "title": "Global Hotel Brand Avani to Launch First NSW Property in Wollongong",
    "summary": "Avani Hotels & Resorts will debut its first purpose-built property in New South Wales with the opening of Avani Wollongong Hotel in 2027. The project, led by Minor Hotels, marks a significant milestone in the brand’s...",
    "url": "https://eturbonews.com/avani-hotels-resorts-wollongong-new-hotel-2027/",
    "source": "eTurboNews",
    "category": "Romania",
    "date": "February 04, 2026"
  },
  {
    "title": "United States and Portugal Strengthen Transatlantic Ties as American Airlines Introduces A321XLR Service to Porto",
    "summary": "United States and Portugal Strengthen Transatlantic Ties as American Airlines Introduces A321XLR Service to Porto American Airlines expands US-Portugal travel with new A321XLR flights to Porto, offering premium...",
    "url": "https://www.travelandtourworld.com/news/article/united-states-and-portugal-strengthen-transatlantic-ties-as-american-airlines-introduces-a321xlr-service-to-porto/",
    "source": "Travel & Tour World",
    "category": "European Tourism",
    "date": "February 06, 2026"
  },
  {
    "title": "Scaling Up African Tourism: Fixing Execution, Hotel Supply, and Investment",
    "summary": "Africa’s tourism growth challenge isn’t demand — it’s execution: scaling reliable operations, mid-market infrastructure, and globally exportable talent to turn world-class assets into sustainable volume growth.",
    "url": "https://skift.com/2026/02/05/scaling-up-african-tourism-fixing-execution-hotel-supply-and-investment/",
    "source": "Skift",
    "category": "Global Travel",
    "date": "February 05, 2026"
  }
]