[
  {
    "title": "Moldova Tourism: Europe’s Last Quiet Frontier and a Strategic Opportunity for Travel Professionals",
    "summary": "Moldova is Europe’s quiet frontier—an uncrowded wine, culture, and rural destination shaped by authenticity rather than mass tourism. Positioned between Ukraine and the EU, it offers travel professionals early-stage...",
    "url": "https://eturbonews.com/moldova-tourism-undiscovered-europe-destination/",
    "source": "eTurboNews",
    "category": "Romania",
    "date": "February 02, 2026"
  },
  {
    "title": "World Tourism Network to Host First ITB Berlin Networking Dinner on Eve of ITB 2026",
    "summary": "The World Tourism Network will host its first ITB Berlin Networking Dinner on March 2, 2026, at Alpha House. Organized with the International Institute for Peace Through Tourism , the African Tourism Board , and...",
    "url": "https://eturbonews.com/world-tourism-network-itb-berlin-networking-dinner-2026/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "February 01, 2026"
  },
  {
    "title": "Japan and JICA Reaffirm Support for Sustainable Tourism Development in Palau",
    "summary": "On January 29, 2026, Japan International Cooperation Agency tourism expert ONODERA Mika met Japan’s Ambassador KASAHARA Kenichi in Palau to discuss advancing sustainable tourism. Talks highlighted Palau’s...",
    "url": "https://eturbonews.com/japan-jica-sustainable-tourism-development-palau/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "February 02, 2026"
  },
  {
    "title": "Everhome Suites Accelerates Its US Expansion With New Openings in Texas, Kentucky and New Jersey as Extended Stay Travel Redefines",
    "summary": "Everhome Suites Accelerates Its US Expansion With New Openings in Texas, Kentucky and New Jersey as Extended Stay Travel Redefines Everhome Suites, the midscale extended-stay brand under Choice Hotels International,...",
    "url": "https://www.travelandtourworld.com/news/article/everhome-suites-accelerates-its-us-expansion-with-new-openings-in-texas-kentucky-and-new-jersey-as-extended-stay-travel-redefines/",
    "source": "Travel & Tour World",
    "category": "Romania",
    "date": "February 02, 2026"
  },
  {
    "title": "Travel and Eat: The Global Race for Culinary Dominance Is Reshaping Tourism",
    "summary": "Culinary tourism is transforming global travel as cities compete to become food capitals. From Rome and Seoul to Lima and Dubai, gastronomy is driving economic growth, cultural preservation, and destination...",
    "url": "https://eturbonews.com/global-race-culinary-capital-tourism/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "January 30, 2026"
  },
  {
    "title": "Horn of Africa leaders inaugurate Shabeely Resort, betting on tourism in eastern Ethiopia’s Somali Region",
    "summary": "The inauguration of Shabeely Resort in Ethiopia’s Somali Region marks a strategic effort to unlock tourism in a historically underdeveloped area. Positioned near Jigjiga, the resort highlights growing infrastructure,...",
    "url": "https://eturbonews.com/shabeely-resort-ethiopia-somali-region-tourism/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "February 01, 2026"
  },
  {
    "title": "Affordable second-hand cars most sought after by drivers in Romania in 2025",
    "summary": "In 2025, Romanian drivers turned to affordable second-hand cars when buying an automobile. Among the most favored car brands are Volkswagen, Dacia, and BMW. In total, more than 548,600 passenger cars were registered...",
    "url": "https://www.romania-insider.com/second-hand-cars-drivers-romania-2025",
    "source": "Romania Insider",
    "category": "Romania",
    "date": "February 02, 2026"
  },
  {
    "title": "Italy’s Milano Cortina 2026 Olympic Games Pushes Accommodation Rates to New Heights and Expands Flight Routes",
    "summary": "Italy’s Milano Cortina 2026 Olympic Games Pushes Accommodation Rates to New Heights and Expands Flight Routes Milano Cortina 2026 is set to be a major turning point for Italy, bringing unprecedented tourism growth...",
    "url": "https://www.travelandtourworld.com/news/article/italys-milano-cortina-2026-olympic-games-pushes-accommodation-rates-to-new-heights-and-expands-flight-routes/",
    "source": "Travel & Tour World",
    "category": "European Tourism",
    "date": "February 02, 2026"
  },
  {
    "title": "Qatar Accelerates Sports Tourism Growth as Qatar Airways Holidays Unveils their Exclusive Fan Packages for the Qatar Football Festival 2026 in Doha",
    "summary": "Qatar Accelerates Sports Tourism Growth as Qatar Airways Holidays Unveils their Exclusive Fan Packages for the Qatar Football Festival 2026 in Doha Qatar strengthens sports tourism as Qatar Airways Holidays launches...",
    "url": "https://www.travelandtourworld.com/news/article/qatar-accelerates-sports-tourism-growth-as-qatar-airways-holidays-unveils-their-exclusive-fan-packages-for-the-qatar-football-festival-2026-in-doha/",
    "source": "Travel & Tour World",
    "category": "Global Travel",
    "date": "February 02, 2026"
  }
]