[
  {
    "title": "H World Group Launches Hanting Inn as Economy Hotel Competition Intensifies in Price-Sensitive Markets",
    "summary": "H World Group has launched Hanting Inn, a new economy hotel brand designed to accelerate asset-light growth and convert existing properties into scalable accommodation. Targeting price-sensitive markets and...",
    "url": "https://eturbonews.com/h-world-group-launches-hanting-inn-economy-hotel-brand-expansion/",
    "source": "eTurboNews",
    "category": "Romania",
    "date": "February 11, 2026"
  },
  {
    "title": "Spanish Investors to Triple Excellence Oyster Bay Room Count, Expand Tourism Investment in Jamaica",
    "summary": "Spanish investors behind the luxury adults-only Excellence Oyster Bay will triple the resort’s room count over the next decade, beginning with expanded beach bungalows by 2026, while committing to workforce training,...",
    "url": "https://eturbonews.com/spanish-investors-triple-excellence-oyster-bay-jamaica/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "February 10, 2026"
  },
  {
    "title": "Salar de Uyuni Eco-Resort Unites Los Tajibos, Atix Hotel, Tarija Vineyard Boutique, Madidi Biodiversity, And Lake Titicaca Heritage, This Isn’t Just A Travel Trend, It’s A Cultural Reset, Bolivia’s New Hotel Openings Are Breaking The Internet For All The Right Reasons",
    "summary": "Salar de Uyuni Eco-Resort Unites Los Tajibos, Atix Hotel, Tarija Vineyard Boutique, Madidi Biodiversity, And Lake Titicaca Heritage, This Isn’t Just A Travel Trend, It’s A Cultural Reset, Bolivia’s New Hotel Openings...",
    "url": "https://www.travelandtourworld.com/news/article/salar-de-uyuni-eco-resort-unites-los-tajibos-atix-hotel-tarija-vineyard-boutique-madidi-biodiversity-and-lake-titicaca-heritage-this-isnt-just-a-travel-trend-its-a-cultural-res/",
    "source": "Travel & Tour World",
    "category": "Global Travel",
    "date": "February 11, 2026"
  },
  {
    "title": "The Guardian: Romania decoupled its economic growth from emissions faster than any other EU country",
    "summary": "An article published by the well-known British publication The Guardian on Wednesday, February 11, praises Romania for managing to decouple its energy sector and the industrial sector from the pollution that...",
    "url": "https://www.romania-insider.com/guardian-romania-economic-growth-emissions-2026",
    "source": "Romania Insider",
    "category": "Romania",
    "date": "February 11, 2026"
  },
  {
    "title": "Scotland Opens a Resort Dedicated to Whisky — Surprisingly, It’s Not About Getting Drunk",
    "summary": "Scotland’s Speyside is preparing to welcome the world’s first luxury whisky resort, blending distilling heritage with high-end hospitality. Far from a drinking playground, the resort focuses on culture,...",
    "url": "https://eturbonews.com/scotland-world-first-luxury-whisky-resort-speyside/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "February 09, 2026"
  },
  {
    "title": "Jamaica to Lead Global Tourism Resilience Talks at GTRCMC Conference in Kenya",
    "summary": "Jamaica's Tourism Minister Edmund Bartlett underscored the urgency of preparedness as global risks intensify, declaring that “ Resilience is the New Tourism Currency .” He emphasized that destinations able to...",
    "url": "https://eturbonews.com/jamaica-global-tourism-resilience-bartlett-new-tourism-currency/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "February 10, 2026"
  },
  {
    "title": "Romanian films presented in five sections of this year’s Berlinale",
    "summary": "Romanian films will be screened in five sections of this year’s Berlinale , the Romanian Cultural Institute (ICR) in Berlin announced. Radu Jude and Adrian Cioflâncă’s Shot Reverse Shot / Plan Contraplan will screen...",
    "url": "https://www.romania-insider.com/ro-films-berlinale-five-sections-feb-2026",
    "source": "Romania Insider",
    "category": "Romania",
    "date": "February 11, 2026"
  },
  {
    "title": "How New Hotel Taxes Could Devastate UK Tourism and What It Means for Your Next Trip to London, Edinburgh, and Beyond!",
    "summary": "How New Hotel Taxes Could Devastate UK Tourism and What It Means for Your Next Trip to London, Edinburgh, and Beyond! The World Travel & Tourism Council (WTTC) warns against the introduction of city-specific...",
    "url": "https://www.travelandtourworld.com/news/article/how-new-hotel-taxes-could-devastate-uk-tourism-and-what-it-means-for-your-next-trip-to-london-edinburgh-and-beyond/",
    "source": "Travel & Tour World",
    "category": "European Tourism",
    "date": "February 11, 2026"
  },
  {
    "title": "Fuel Crisis Grounds Flights to Cuba, Straining Tourism and Small Businesses — Can Jamaica or the Cayman Islands Step In?",
    "summary": "As jet fuel shortages force airline cancellations to Cuba, tourism and small businesses suffer. Regional neighbors Jamaica and the Cayman Islands emerge as potential refueling hubs—raising questions about resilience,...",
    "url": "https://eturbonews.com/fuel-crisis-cuba-flights-tourism-jamaica-cayman-islands/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "February 10, 2026"
  }
]