[
  {
    "title": "H World Group Launches Hanting Inn as Economy Hotel Competition Intensifies in Price-Sensitive Markets",
    "summary": "H World Group has launched Hanting Inn, a new economy hotel brand designed to accelerate asset-light growth and convert existing properties into scalable accommodation. Targeting price-sensitive markets and...",
    "url": "https://eturbonews.com/h-world-group-launches-hanting-inn-economy-hotel-brand-expansion/",
    "source": "eTurboNews",
    "category": "Romania",
    "date": "February 11, 2026"
  },
  {
    "title": "Spanish Investors to Triple Excellence Oyster Bay Room Count, Expand Tourism Investment in Jamaica",
    "summary": "Spanish investors behind the luxury adults-only Excellence Oyster Bay will triple the resort’s room count over the next decade, beginning with expanded beach bungalows by 2026, while committing to workforce training,...",
    "url": "https://eturbonews.com/spanish-investors-triple-excellence-oyster-bay-jamaica/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "February 10, 2026"
  },
  {
    "title": "Hong Kong Tourism Board Opens First MICE Visitor Centre at HKCEC, Following Global Convention Trends",
    "summary": "The Hong Kong Tourism Board (HKTB) has launched a new Visitor Service Centre at the Hong Kong Convention and Exhibition Centre (HKCEC), positioning itself in line with a growing global trend where tourism boards...",
    "url": "https://eturbonews.com/hong-kong-tourism-board-opens-first-mice-visitor-centre-at-hkcec-following-global-convention-trends/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "February 12, 2026"
  },
  {
    "title": "Italian Costa Cruises continues expansion in Romania, its second-largest market in CEE",
    "summary": "Italian company Costa Cruises said it is stepping up its expansion in Romania, describing the country as its second-largest market in Central and Eastern Europe and one of the fastest-growing in the region. The...",
    "url": "https://www.romania-insider.com/costa-cruises-expansion-romania-feb-2026",
    "source": "Romania Insider",
    "category": "Romania",
    "date": "February 12, 2026"
  },
  {
    "title": "Mega Baltic Sea Resort Set to Open in 2026 as Industry Debates Future of Coastal Tourism",
    "summary": "A massive new Baltic Sea resort in Poland, expected to open in 2026, is raising concerns among German Ostsee hoteliers. With 1,200 rooms, year-round entertainment, and competitive pricing, the project highlights...",
    "url": "https://eturbonews.com/baltic-mega-resort-opening-2026-ostsee-tourism-competition/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "February 12, 2026"
  },
  {
    "title": "University of Maine International Dance Festival 2026 in Orono, United States Showcases Global Traditions and Boosts Cultural Tourism in Maine: Check It Out Now",
    "summary": "University of Maine International Dance Festival 2026 in Orono, United States Showcases Global Traditions and Boosts Cultural Tourism in Maine: Check It Out Now UMaine’s International Dance Festival in Orono, USA...",
    "url": "https://www.travelandtourworld.com/news/article/university-of-maine-international-dance-festival-2026-in-orono-united-states-showcases-global-traditions-and-boosts-cultural-tourism-in-maine-check-it-out-now/",
    "source": "Travel & Tour World",
    "category": "Global Travel",
    "date": "February 13, 2026"
  },
  {
    "title": "Weekend calendar: Il Cinema Ritrovato on Tour, tourism fair, concerts, exhibitions",
    "summary": "Classic Italian cinema and a Tarantino retrospective are part of the weekend’s offer in Bucharest, where the exhibition focused on the traditional Romanian blouse ia has been extended. In Bucharest: Il Cinema...",
    "url": "https://www.romania-insider.com/weekend-calendar-feb-12-2026",
    "source": "Romania Insider",
    "category": "Romania",
    "date": "February 12, 2026"
  },
  {
    "title": "Guernsey vs. the Mediterranean: How a Small Channel Island Is Reinventing Tourism to Stay Competitive",
    "summary": "Guernsey is redefining island tourism by targeting high-value visitors instead of mass arrivals. Facing strong competition from Mediterranean destinations and nearby Jersey, the Channel Island is betting on...",
    "url": "https://eturbonews.com/guernsey-tourism-strategy-channel-island-competition-europe/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "February 12, 2026"
  },
  {
    "title": "Tripadvisor Sees Traffic Decline from AI Overviews, Considers ‘Strategic Alternatives’ (Again)",
    "summary": "Tripadvisor has borne the brunt of declining SEO traffic from Google for many years. Now AI Overviews are pinching Tripadvisor even harder.",
    "url": "https://skift.com/2026/02/12/tripadvisor-sees-traffic-decline-from-ai-overviews-considers-strategic-alternatives-again/",
    "source": "Skift",
    "category": "Global Travel",
    "date": "February 12, 2026"
  }
]