[
  {
    "title": "Wizz Air carries 14.5 million passengers in Romania in 2025 as local operations expand",
    "summary": "Wizz Air transported around 14.5 million passengers to and from Romania in 2025, up 13.1% compared to the previous year, as the airline strengthened its presence on the local market. According to the company, Romania...",
    "url": "https://www.romania-insider.com/wizz-air-passengers-romania-2025",
    "source": "Romania Insider",
    "category": "Romania",
    "date": "February 06, 2026"
  },
  {
    "title": "Bulgarians Travel More, Farther, and Longer: How Destinations Can Win a Growing Market",
    "summary": "Despite having the EU’s lowest average disposable income, Bulgarians are traveling abroad more than ever. In 2026, they are choosing longer holidays, farther destinations, and increasingly cruises. For destinations,...",
    "url": "https://eturbonews.com/bulgarian-outbound-travel-market-2026/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "February 07, 2026"
  },
  {
    "title": "From Louvre to Guggenheim: Abu Dhabi Cultural Tourism Emerges as a Must-Visit Global Destination for Art and Heritage Lovers",
    "summary": "From Louvre to Guggenheim: Abu Dhabi Cultural Tourism Emerges as a Must-Visit Global Destination for Art and Heritage Lovers Discover Abu Dhabi Cultural Tourism with world‑class museums in Saadiyat Island, from...",
    "url": "https://www.travelandtourworld.com/news/article/from-louvre-to-guggenheim-abu-dhabi-cultural-tourism-emerges-as-a-must-visit-global-destination-for-art-and-heritage-lovers/",
    "source": "Travel & Tour World",
    "category": "Global Travel",
    "date": "February 08, 2026"
  },
  {
    "title": "Report: Romania registers one of the highest shares of disabled people at risk of poverty, social exclusion in EU",
    "summary": "Romania registers one of the highest shares in Europe of people aged over 16 with disabilities who are at risk of poverty or social exclusion, according to Eurostat data processed by Monitorul Social, a project of...",
    "url": "https://www.romania-insider.com/romania-disabled-people-risk-poverty-feb-2026",
    "source": "Romania Insider",
    "category": "Romania",
    "date": "February 06, 2026"
  },
  {
    "title": "The Advantages of Launching a Business in Germany",
    "summary": "As one of the largest economies in the world, Germany is without a doubt one of the best countries to do business in. Economic stability, excellent infrastructure, and trade cooperation with nations worldwide are...",
    "url": "https://www.romania-insider.com/advantages-launching-business-germany",
    "source": "Romania Insider",
    "category": "European Tourism",
    "date": "February 06, 2026"
  },
  {
    "title": "Antigua and Barbuda Puts Sustainability and People at the Center of Its 2026 Tourism Strategy",
    "summary": "Antigua and Barbuda has outlined a people-first tourism strategy for 2026, focusing on sustainable growth, major hotel investments, cruise expansion, and improved air access. Tourism Minister Charles Fernandez said...",
    "url": "https://eturbonews.com/antigua-barbuda-tourism-strategy-2026/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "February 04, 2026"
  },
  {
    "title": "Revolut Business: Romanian companies prioritize investment in basic IT over AI in 2026",
    "summary": "New research by Revolut Business among 150 Romanian business decision-makers (CEOs, CFOs, and COOs) revealed that local companies prefer to invest their money in modernizing their IT infrastructure and automating...",
    "url": "https://www.romania-insider.com/revolut-business-romanian-companies-tech-feb-2025",
    "source": "Romania Insider",
    "category": "Romania",
    "date": "February 06, 2026"
  },
  {
    "title": "Private Healthcare Costs in Southeast Asia: A Practical Comparison for Travelers",
    "summary": "Southeast Asia offers travelers a wide spectrum of private healthcare costs, from Singapore’s premium pricing to highly affordable routine care in Vietnam, Cambodia, and Laos. With health check-ups ranging from under...",
    "url": "https://eturbonews.com/southeast-asia-private-healthcare-costs/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "February 06, 2026"
  },
  {
    "title": "Major Tourism Investment Signals Economic Shift in The Gambia",
    "summary": "A major beachfront tourism investment in Tanji signals a potential turning point for The Gambia’s economy. The project is expected to boost employment, attract international visitors, and elevate West Africa’s...",
    "url": "https://eturbonews.com/gambia-tourism-investment-economic-impact/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "February 04, 2026"
  }
]