[
  {
    "title": "Romanian IT deal: Zitec acquires Equilobe to accelerate international expansion",
    "summary": "Romanian IT and digital transformation company Zitec has acquired local technology firm Equilobe in a strategic move aimed at accelerating its international expansion, particularly in Western Europe. According to...",
    "url": "https://www.romania-insider.com/zitec-equilobe-deal-romania-feb-2026",
    "source": "Romania Insider",
    "category": "Romania",
    "date": "February 13, 2026"
  },
  {
    "title": "Spanish Investors to Triple Excellence Oyster Bay Room Count, Expand Tourism Investment in Jamaica",
    "summary": "Spanish investors behind the luxury adults-only Excellence Oyster Bay will triple the resort’s room count over the next decade, beginning with expanded beach bungalows by 2026, while committing to workforce training,...",
    "url": "https://eturbonews.com/spanish-investors-triple-excellence-oyster-bay-jamaica/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "February 10, 2026"
  },
  {
    "title": "Mozambique Goes Digital: New e-Visa Platform Signals a Forward-Looking Tourism Strategy",
    "summary": "Mozambique’s new e-Visa platform opens digital access to travellers from 183 countries, signalling a bold step toward modern tourism and investment. By simplifying entry while strengthening security and...",
    "url": "https://eturbonews.com/mozambique-new-evisa-platform-tourism-access-africa/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "February 13, 2026"
  },
  {
    "title": "Prism Pushes Into Europe With Hotels as IPO Nears",
    "summary": "Prism has Belvilla's presence and the brandscape. Now, all it needs to do is replicate the UK's success in Germany and it's got a scalable international model, too.",
    "url": "https://skift.com/2026/02/13/prism-pushes-into-europe-with-hotels-as-ipo-nears/",
    "source": "Skift",
    "category": "Romania",
    "date": "February 13, 2026"
  },
  {
    "title": "Mega Baltic Sea Resort Set to Open in 2026 as Industry Debates Future of Coastal Tourism",
    "summary": "A massive new Baltic Sea resort in Poland, expected to open in 2026, is raising concerns among German Ostsee hoteliers. With 1,200 rooms, year-round entertainment, and competitive pricing, the project highlights...",
    "url": "https://eturbonews.com/baltic-mega-resort-opening-2026-ostsee-tourism-competition/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "February 12, 2026"
  },
  {
    "title": "Hong Kong Tourism Board Opens First MICE Visitor Centre at HKCEC, Following Global Convention Trends",
    "summary": "The Hong Kong Tourism Board (HKTB) has launched a new Visitor Service Centre at the Hong Kong Convention and Exhibition Centre (HKCEC), positioning itself in line with a growing global trend where tourism boards...",
    "url": "https://eturbonews.com/hong-kong-tourism-board-opens-first-mice-visitor-centre-at-hkcec-following-global-convention-trends/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "February 12, 2026"
  },
  {
    "title": "Expedia’s B2B Surge Buys Time for Vrbo and Hotels.com",
    "summary": "Expedia's B2B division is growing nearly five times faster than its consumer brands. That gap buys time for the Vrbo and Hotels.com turnaround — but 2026 will test whether efficiency gains can translate into...",
    "url": "https://skift.com/2026/02/12/expedia-q4-2025-earnings-b2b-b2c/",
    "source": "Skift",
    "category": "Romania",
    "date": "February 13, 2026"
  },
  {
    "title": "Guernsey vs. the Mediterranean: How a Small Channel Island Is Reinventing Tourism to Stay Competitive",
    "summary": "Guernsey is redefining island tourism by targeting high-value visitors instead of mass arrivals. Facing strong competition from Mediterranean destinations and nearby Jersey, the Channel Island is betting on...",
    "url": "https://eturbonews.com/guernsey-tourism-strategy-channel-island-competition-europe/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "February 12, 2026"
  },
  {
    "title": "Cairo Hosts Future Hospitality Summit 2026 as Egypt Emerges as Premier Destination for Global Hotel Investment: You Need to Know",
    "summary": "Cairo Hosts Future Hospitality Summit 2026 as Egypt Emerges as Premier Destination for Global Hotel Investment: You Need to Know Cairo is set to become the epicenter of hospitality investment this November as the...",
    "url": "https://www.travelandtourworld.com/news/article/cairo-hosts-future-hospitality-summit-2026-as-egypt-emerges-as-premier-destination-for-global-hotel-investment-you-need-to-know/",
    "source": "Travel & Tour World",
    "category": "Global Travel",
    "date": "February 14, 2026"
  }
]