[
  {
    "title": "Global Hotel Brand Avani to Launch First NSW Property in Wollongong",
    "summary": "Avani Hotels & Resorts will debut its first purpose-built property in New South Wales with the opening of Avani Wollongong Hotel in 2027. The project, led by Minor Hotels, marks a significant milestone in the brand’s...",
    "url": "https://eturbonews.com/avani-hotels-resorts-wollongong-new-hotel-2027/",
    "source": "eTurboNews",
    "category": "Romania",
    "date": "February 04, 2026"
  },
  {
    "title": "Marriott Internationa Bets Big on Vietnam as Global Hotel Giants Battle for Market Share",
    "summary": "Marriott International is accelerating its expansion in Vietnam with a multi-property agreement amid intensifying global hotel competition. The U.S.-based hospitality giant faces growing pressure from European and...",
    "url": "https://eturbonews.com/marriott-vietnam-expansion-hotel-competition/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "February 03, 2026"
  },
  {
    "title": "Antigua and Barbuda Puts Sustainability and People at the Center of Its 2026 Tourism Strategy",
    "summary": "Antigua and Barbuda has outlined a people-first tourism strategy for 2026, focusing on sustainable growth, major hotel investments, cruise expansion, and improved air access. Tourism Minister Charles Fernandez said...",
    "url": "https://eturbonews.com/antigua-barbuda-tourism-strategy-2026/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "February 04, 2026"
  },
  {
    "title": "DAN AIR launches new European destinations from Bacău and Bucharest",
    "summary": "DAN AIR said it will expand its regular flight network from Bucharest and Bacău starting in April, adding six new destinations in Spain, Italy, France, and Cyprus. The privately owned Romanian carrier will launch new...",
    "url": "https://www.romania-insider.com/dan-air-new-destinations-bucharest-bacau-2026",
    "source": "Romania Insider",
    "category": "Romania",
    "date": "February 04, 2026"
  },
  {
    "title": "Spain Emerges as World’s Tourism Powerhouse — Madrid Declared Global Tourism Capital",
    "summary": "Spain has reinforced its status as a global tourism leader after welcoming nearly 97 million international visitors , generating record revenues. With Madrid hosting both UN Tourism and the WTTC headquarters , the...",
    "url": "https://eturbonews.com/spain-tourism-records-madrid-global-tourism-capital/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "February 04, 2026"
  },
  {
    "title": "Major Tourism Investment Signals Economic Shift in The Gambia",
    "summary": "A major beachfront tourism investment in Tanji signals a potential turning point for The Gambia’s economy. The project is expected to boost employment, attract international visitors, and elevate West Africa’s...",
    "url": "https://eturbonews.com/gambia-tourism-investment-economic-impact/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "February 04, 2026"
  },
  {
    "title": "Bucharest better connected with Scandinavian cities after Tarom signs codesharing agreement with SAS",
    "summary": "Tarom and Scandinavian Airlines (SAS) announced the launch of a codeshare commercial cooperation, a partnership that significantly expands travel options for passengers in Romania, according to press releases from...",
    "url": "https://www.romania-insider.com/tarom-sas-codeshare-february-2026",
    "source": "Romania Insider",
    "category": "Romania",
    "date": "February 04, 2026"
  },
  {
    "title": "Cyprus Puts “Tourism of Tomorrow” in the Spotlight as Europe’s Sustainability Leaders Head to Nicosia",
    "summary": "Cyprus is spotlighting sustainable, year-round travel as Nicosia hosts “The Tourism of Tomorrow at the Heart of Europe.” Marking 20 years of CSTI leadership, the European conference brings policymakers and industry...",
    "url": "https://eturbonews.com/destination-cyprus-tourism-of-tomorrow-sustainable-tourism-conference-nicosia/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "February 03, 2026"
  },
  {
    "title": "Margaritaville Beach House Key West Names Alin Bodea General Manager",
    "summary": "Margaritaville Beach House Key West has appointed Alin Bodea as General Manager of its 186-room oceanfront resort on Smathers Beach. In his new role, Bodea will oversee day-to-day operations, lead the hospitality...",
    "url": "https://eturbonews.com/margaritaville-beach-house-key-west-appoints-alin-bodea-general-manager/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "February 03, 2026"
  }
]