[
  {
    "title": "Global Hotel Brand Avani to Launch First NSW Property in Wollongong",
    "summary": "Avani Hotels & Resorts will debut its first purpose-built property in New South Wales with the opening of Avani Wollongong Hotel in 2027. The project, led by Minor Hotels, marks a significant milestone in the brand’s...",
    "url": "https://eturbonews.com/avani-hotels-resorts-wollongong-new-hotel-2027/",
    "source": "eTurboNews",
    "category": "Romania",
    "date": "February 04, 2026"
  },
  {
    "title": "Marriott Internationa Bets Big on Vietnam as Global Hotel Giants Battle for Market Share",
    "summary": "Marriott International is accelerating its expansion in Vietnam with a multi-property agreement amid intensifying global hotel competition. The U.S.-based hospitality giant faces growing pressure from European and...",
    "url": "https://eturbonews.com/marriott-vietnam-expansion-hotel-competition/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "February 03, 2026"
  },
  {
    "title": "Antigua and Barbuda Puts Sustainability and People at the Center of Its 2026 Tourism Strategy",
    "summary": "Antigua and Barbuda has outlined a people-first tourism strategy for 2026, focusing on sustainable growth, major hotel investments, cruise expansion, and improved air access. Tourism Minister Charles Fernandez said...",
    "url": "https://eturbonews.com/antigua-barbuda-tourism-strategy-2026/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "February 04, 2026"
  },
  {
    "title": "The Georgian Hotel in Santa Monica Reopens Under New Management with Dreamscape Hospitality and Transition to Hyatt Soft Brand",
    "summary": "The Georgian Hotel in Santa Monica Reopens Under New Management with Dreamscape Hospitality and Transition to Hyatt Soft Brand The Georgian Hotel in Santa Monica embarks on a new chapter under Dreamscape Hospitality,...",
    "url": "https://www.travelandtourworld.com/news/article/the-georgian-hotel-in-santa-monica-reopens-under-new-management-with-dreamscape-hospitality-and-transition-to-hyatt-soft-brand/",
    "source": "Travel & Tour World",
    "category": "Romania",
    "date": "February 04, 2026"
  },
  {
    "title": "Spain Emerges as World’s Tourism Powerhouse — Madrid Declared Global Tourism Capital",
    "summary": "Spain has reinforced its status as a global tourism leader after welcoming nearly 97 million international visitors , generating record revenues. With Madrid hosting both UN Tourism and the WTTC headquarters , the...",
    "url": "https://eturbonews.com/spain-tourism-records-madrid-global-tourism-capital/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "February 04, 2026"
  },
  {
    "title": "Major Tourism Investment Signals Economic Shift in The Gambia",
    "summary": "A major beachfront tourism investment in Tanji signals a potential turning point for The Gambia’s economy. The project is expected to boost employment, attract international visitors, and elevate West Africa’s...",
    "url": "https://eturbonews.com/gambia-tourism-investment-economic-impact/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "February 04, 2026"
  },
  {
    "title": "DAN AIR launches new European destinations from Bacău and Bucharest",
    "summary": "DAN AIR said it will expand its regular flight network from Bucharest and Bacău starting in April, adding six new destinations in Spain, Italy, France, and Cyprus. The privately owned Romanian carrier will launch new...",
    "url": "https://www.romania-insider.com/dan-air-new-destinations-bucharest-bacau-2026",
    "source": "Romania Insider",
    "category": "Romania",
    "date": "February 04, 2026"
  },
  {
    "title": "Cyprus Puts “Tourism of Tomorrow” in the Spotlight as Europe’s Sustainability Leaders Head to Nicosia",
    "summary": "Cyprus is spotlighting sustainable, year-round travel as Nicosia hosts “The Tourism of Tomorrow at the Heart of Europe.” Marking 20 years of CSTI leadership, the European conference brings policymakers and industry...",
    "url": "https://eturbonews.com/destination-cyprus-tourism-of-tomorrow-sustainable-tourism-conference-nicosia/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "February 03, 2026"
  },
  {
    "title": "Boeing 737 Max Deal Offers Clues About Cambodia’s Tourism Strategy",
    "summary": "Big widebody orders grab the headlines, but relatively modest deals such as this one can still have an outsized impact on regional markets.",
    "url": "https://skift.com/2026/02/04/boeing-737-max-deal-offers-clues-about-cambodias-growth-strategy/",
    "source": "Skift",
    "category": "Global Travel",
    "date": "February 04, 2026"
  }
]