[
  {
    "title": "Moldova Tourism: Europe’s Last Quiet Frontier and a Strategic Opportunity for Travel Professionals",
    "summary": "Moldova is Europe’s quiet frontier—an uncrowded wine, culture, and rural destination shaped by authenticity rather than mass tourism. Positioned between Ukraine and the EU, it offers travel professionals early-stage...",
    "url": "https://eturbonews.com/moldova-tourism-undiscovered-europe-destination/",
    "source": "eTurboNews",
    "category": "Romania",
    "date": "February 02, 2026"
  },
  {
    "title": "German Government Adopts New National Tourism Strategy to Boost Competitiveness and Sustainability",
    "summary": "Germany has adopted a new National Tourism Strategy, elevating tourism to a federal priority. The policy focuses on stronger coordination, modern infrastructure, reduced bureaucracy, digitalisation, workforce...",
    "url": "https://eturbonews.com/germany-national-tourism-strategy-competitiveness-sustainability/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "February 02, 2026"
  },
  {
    "title": "Japan and JICA Reaffirm Support for Sustainable Tourism Development in Palau",
    "summary": "On January 29, 2026, Japan International Cooperation Agency tourism expert ONODERA Mika met Japan’s Ambassador KASAHARA Kenichi in Palau to discuss advancing sustainable tourism. Talks highlighted Palau’s...",
    "url": "https://eturbonews.com/japan-jica-sustainable-tourism-development-palau/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "February 02, 2026"
  },
  {
    "title": "SAS and TAROM Expand Partnership With New Codeshare Agreement",
    "summary": "Scandinavian Airlines has signed a new commercial codeshare agreement with TAROM, widening connectivity between the Nordic region and Romania with seamless transfers via major European hubs. The launch aligns with a...",
    "url": "https://eturbonews.com/sas-tarom-expand-partnership-new-codeshare-agreement/",
    "source": "eTurboNews",
    "category": "Romania",
    "date": "February 03, 2026"
  },
  {
    "title": "World Tourism Network to Host First ITB Berlin Networking Dinner on Eve of ITB 2026",
    "summary": "The World Tourism Network will host its first ITB Berlin Networking Dinner on March 2, 2026, at Alpha House. Organized with the International Institute for Peace Through Tourism , the African Tourism Board , and...",
    "url": "https://eturbonews.com/world-tourism-network-itb-berlin-networking-dinner-2026/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "February 01, 2026"
  },
  {
    "title": "JTB CEO Says Japan’s Tourism Problem Is Distribution, Not Overtourism",
    "summary": "Japan doesn’t have too many tourists. It has too many tourists being sent to the same places. Until that changes, talks on solving overtourism will just remain recycled rhetoric.",
    "url": "https://skift.com/2026/02/02/jtb-ceo-says-japans-tourism-problem-is-distribution-not-overtourism/",
    "source": "Skift",
    "category": "Global Travel",
    "date": "February 03, 2026"
  },
  {
    "title": "Qantas to Exit Jetstar Japan Stake as JAL-Led Japanese Investor Group Plans Brand Refresh",
    "summary": "Qantas and Japan Airlines have signed a non-binding MoU to transition Jetstar Japan to a Japanese capital-led ownership structure. Qantas would divest its 33.32% shareholding, subject to approvals, with agreement...",
    "url": "https://eturbonews.com/qantas-jal-jetstar-japan-japanese-led-ownership-transition-2026/",
    "source": "eTurboNews",
    "category": "Romania",
    "date": "February 03, 2026"
  },
  {
    "title": "Cyprus Puts “Tourism of Tomorrow” in the Spotlight as Europe’s Sustainability Leaders Head to Nicosia",
    "summary": "Cyprus is spotlighting sustainable, year-round travel as Nicosia hosts “The Tourism of Tomorrow at the Heart of Europe.” Marking 20 years of CSTI leadership, the European conference brings policymakers and industry...",
    "url": "https://eturbonews.com/destination-cyprus-tourism-of-tomorrow-sustainable-tourism-conference-nicosia/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "February 03, 2026"
  },
  {
    "title": "Seychelles and Kenya Push New Tourism, Airlift, and Blue Economy Cooperation",
    "summary": "Seychelles and Kenya are deepening cooperation on tourism and the blue economy, with a new Seychelles Tourism–Kenya Airways push aimed at stronger airlift, joint promotion, and multi-destination travel. Beyond...",
    "url": "https://eturbonews.com/seychelles-kenya-tourism-blue-economy-cooperation/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "February 03, 2026"
  }
]