[
  {
    "title": "Two Ways to Celebrate Love at Radisson Blu Hotel, Bucharest",
    "summary": "Love is never just one thing: at Radisson Blu Hotel, Bucharest, Valentine’s Day is celebrated through two distinct experiences, each with its own rhythm, atmosphere, and interpretation of indulgence. On February 13,...",
    "url": "https://www.romania-insider.com/two-ways-celebrate-love-radisson-blu-hotel-bucharest",
    "source": "Romania Insider",
    "category": "Romania",
    "date": "February 10, 2026"
  },
  {
    "title": "Long-haul travellers grow more cautious in 2026, while safety and flexibility shape demand for Europe",
    "summary": "Global long-haul travel intentions soften for 2026 as financial and time constraints push travellers towards domestic and short-haul trips. Interest in visiting Europe remains solid but declines slightly across key...",
    "url": "https://etc-corporate.org/news/long-haul-travellers-grow-more-cautious-in-2026-while-safety-and-flexibility-shape-demand-for-europe/",
    "source": "European Travel Commission",
    "category": "European Tourism",
    "date": "February 09, 2026"
  },
  {
    "title": "Bad Bunny Brought Buzz — Can Discover Puerto Rico Turn It Into Bookings?",
    "summary": "How do you measure the value of an organic cultural moment you can’t buy? Puerto Rico’s DMO just ran the experiment.",
    "url": "https://skift.com/2026/02/10/bad-bunny-brought-buzz-can-discover-puerto-rico-turn-it-into-bookings/",
    "source": "Skift",
    "category": "Global Travel",
    "date": "February 10, 2026"
  },
  {
    "title": "Romania’s “royal town” Curtea de Argeș without potable water for the fourth consecutive month",
    "summary": "Curtea de Argeș, the second capital of Wallachia in the 14th century and one of Romania’s most important and charming historic towns, has been without potable water for the fourth consecutive month. The situation...",
    "url": "https://www.romania-insider.com/curtea-de-arges-potable-water-problems-feb-2026",
    "source": "Romania Insider",
    "category": "Romania",
    "date": "February 11, 2026"
  },
  {
    "title": "Delhi Hotels See Coldplay-Style Price Spike, This Time for an AI Summit",
    "summary": "As India strives to become a destination for meetings, incentives, conferences, and events, the pricing and sales trends around the AI Impact Summit show that Indian hotels now have the ability to charge higher...",
    "url": "https://skift.com/2026/02/10/delhi-hotels-see-coldplay-style-price-spike-this-time-for-an-ai-summit/",
    "source": "Skift",
    "category": "Global Travel",
    "date": "February 11, 2026"
  },
  {
    "title": "Education without borders: how international schooling shapes future careers",
    "summary": "Open Day at Internationale Deutsche Schule Bukarest on 7 March, starting at 10:00 International schooling is increasingly shaped by structured cooperation between national education systems rather than by isolated...",
    "url": "https://www.romania-insider.com/education-without-borders-how-international-schooling-shapes-future-careers",
    "source": "Romania Insider",
    "category": "Romania",
    "date": "February 11, 2026"
  },
  {
    "title": "TUI Pushes AI and App Bookings as Cruises Drive Earnings",
    "summary": "Cruises are carrying TUI’s results, but distribution is moving away from the web and toward apps and artificial intelligence.",
    "url": "https://skift.com/2026/02/10/tui-pushes-ai-and-app-bookings-as-cruises-drive-earnings/",
    "source": "Skift",
    "category": "Global Travel",
    "date": "February 10, 2026"
  },
  {
    "title": "Marriott Expects Olympics and World Cup Lift: Live Tourism as New ‘Norm’",
    "summary": "Marriott isn't treating the Olympics and World Cup as one-off windfalls. It says experiences-driven travel remains strong and that 'live tourism' has become a steady growth lever.",
    "url": "https://skift.com/2026/02/10/marriott-expects-olympics-and-world-cup-lift-live-tourism-as-new-norm/",
    "source": "Skift",
    "category": "Global Travel",
    "date": "February 10, 2026"
  },
  {
    "title": "El Al to Fight $39 Million Antitrust Fine Over ‘Excessive and Unfair’ Wartime Pricing",
    "summary": "El Al’s dominance delivered bumper profits – now it’s triggering a rare antitrust test of how far airlines can push pricing power during a crisis.",
    "url": "https://skift.com/2026/02/10/el-al-to-fight-39-million-antitrust-fine-over-excessive-and-unfair-wartime-pricing/",
    "source": "Skift",
    "category": "Global Travel",
    "date": "February 10, 2026"
  }
]