[
  {
    "title": "Tension rises as Romanian Constitutional Court’s decision on magistrates’ pensions approaches",
    "summary": "The government of Romania informed the Constitutional Court (CCR) about the impact of yet another postponement of a decision on the magistrates’ pensions law expected for February 11, while the High Court (ICCJ) –...",
    "url": "https://www.romania-insider.com/tensions-magistrates-pensions-ccr-feb-2026",
    "source": "Romania Insider",
    "category": "Romania",
    "date": "February 09, 2026"
  },
  {
    "title": "Bulgarians Travel More, Farther, and Longer: How Destinations Can Win a Growing Market",
    "summary": "Despite having the EU’s lowest average disposable income, Bulgarians are traveling abroad more than ever. In 2026, they are choosing longer holidays, farther destinations, and increasingly cruises. For destinations,...",
    "url": "https://eturbonews.com/bulgarian-outbound-travel-market-2026/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "February 07, 2026"
  },
  {
    "title": "Antigua and Barbuda Puts Sustainability and People at the Center of Its 2026 Tourism Strategy",
    "summary": "Antigua and Barbuda has outlined a people-first tourism strategy for 2026, focusing on sustainable growth, major hotel investments, cruise expansion, and improved air access. Tourism Minister Charles Fernandez said...",
    "url": "https://eturbonews.com/antigua-barbuda-tourism-strategy-2026/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "February 04, 2026"
  },
  {
    "title": "Dutch NewCold builds large frozen warehouse near Bucharest with EUR 73 mln loan from EBRD, BCR",
    "summary": "BCR and EBRD are lending RON 365.6 million (EUR 73 million) for the construction of the first fully automated cold storage warehouse in Romania, a project of the Dutch company NewCold, to be located near Bucharest....",
    "url": "https://www.romania-insider.com/newcold-frozen-warehouse-bucharest-feb-2026",
    "source": "Romania Insider",
    "category": "Romania",
    "date": "February 09, 2026"
  },
  {
    "title": "Radisson Hotel Group Supercharges Global Tourism in 2026 with a Jaw-Dropping Expansion Across MENA, India, Europe, and Beyond – The Ultimate Travel Boom!",
    "summary": "Radisson Hotel Group Supercharges Global Tourism in 2026 with a Jaw-Dropping Expansion Across MENA, India, Europe, and Beyond – The Ultimate Travel Boom! Radisson Hotel Group's massive 2026 expansion across MENA,...",
    "url": "https://www.travelandtourworld.com/news/article/radisson-hotel-group-supercharges-global-tourism-in-2026-with-a-jaw-dropping-expansion-across-mena-india-europe-and-beyond-the-ultimate-travel-boom/",
    "source": "Travel & Tour World",
    "category": "European Tourism",
    "date": "February 09, 2026"
  },
  {
    "title": "Seychelles: Sherin Francis Received Women’s Tabloid Award 2025 for Excellence in Tourism Leadership",
    "summary": "Sherin Francis , Principal Secretary for Tourism of the Republic of Seychelles, has been honoured with the Women’s Tabloid Award 2025 for Excellence in Tourism Leadership, recognising her passion-driven commitment to...",
    "url": "https://eturbonews.com/sherin-francis-womens-tabloid-award-2025-tourism-leadership/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "February 08, 2026"
  },
  {
    "title": "Fitch rates Romania's Romgaz in line with sovereign – one notch above standalone credit profile",
    "summary": "Fitch Ratings has affirmed the BBB- Long-Term Issuer Default Rating (IDR) with a negative outlook for the Romania-based Romgaz (BVB: SNG) – including a one-notch uplift from its bb+ Standalone Credit Profile (SCP)...",
    "url": "https://www.romania-insider.com/fitch-romgaz-rating-feb-2026",
    "source": "Romania Insider",
    "category": "Romania",
    "date": "February 09, 2026"
  },
  {
    "title": "Russia Joins Germany, UK and Other Leading Nations Drive Turkey’s Record-Breaking 2025 Tourism Growth, Reaching Over Sixty Million Visitors and Over Sixty Five Billion Dollars in Revenue: Discover the New Details You Need to Know",
    "summary": "Russia Joins Germany, UK and Other Leading Nations Drive Turkey’s Record-Breaking 2025 Tourism Growth, Reaching Over Sixty Million Visitors and Over Sixty Five Billion Dollars in Revenue: Discover the New Details You...",
    "url": "https://www.travelandtourworld.com/news/article/russia-joins-germany-uk-and-other-leading-nations-drive-turkeys-record-breaking-2025-tourism-growth-reaching-over-sixty-million-visitors-and-over-sixty-five-billion-dollars-in-revenue-disc/",
    "source": "Travel & Tour World",
    "category": "European Tourism",
    "date": "February 09, 2026"
  },
  {
    "title": "Nigerian Billionaire Aliko Dangote Enters African Tourism with Acquisition of Pollman’s Tours",
    "summary": "Nigerian billionaire Aliko Dangote has entered Africa’s tourism sector with a USD 31 million acquisition of Kenya’s Pollman’s Tours and Safaris, signaling a strategic expansion into East Africa and boosting...",
    "url": "https://eturbonews.com/aliko-dangote-enters-african-tourism-pollmans-tours-acquisition/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "February 08, 2026"
  }
]