[
  {
    "title": "H World Group Launches Hanting Inn as Economy Hotel Competition Intensifies in Price-Sensitive Markets",
    "summary": "H World Group has launched Hanting Inn, a new economy hotel brand designed to accelerate asset-light growth and convert existing properties into scalable accommodation. Targeting price-sensitive markets and...",
    "url": "https://eturbonews.com/h-world-group-launches-hanting-inn-economy-hotel-brand-expansion/",
    "source": "eTurboNews",
    "category": "Romania",
    "date": "February 11, 2026"
  },
  {
    "title": "Spanish Investors to Triple Excellence Oyster Bay Room Count, Expand Tourism Investment in Jamaica",
    "summary": "Spanish investors behind the luxury adults-only Excellence Oyster Bay will triple the resort’s room count over the next decade, beginning with expanded beach bungalows by 2026, while committing to workforce training,...",
    "url": "https://eturbonews.com/spanish-investors-triple-excellence-oyster-bay-jamaica/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "February 10, 2026"
  },
  {
    "title": "Hong Kong Tourism Board Opens First MICE Visitor Centre at HKCEC, Following Global Convention Trends",
    "summary": "The Hong Kong Tourism Board (HKTB) has launched a new Visitor Service Centre at the Hong Kong Convention and Exhibition Centre (HKCEC), positioning itself in line with a growing global trend where tourism boards...",
    "url": "https://eturbonews.com/hong-kong-tourism-board-opens-first-mice-visitor-centre-at-hkcec-following-global-convention-trends/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "February 12, 2026"
  },
  {
    "title": "Italian Costa Cruises continues expansion in Romania, its second-largest market in CEE",
    "summary": "Italian company Costa Cruises said it is stepping up its expansion in Romania, describing the country as its second-largest market in Central and Eastern Europe and one of the fastest-growing in the region. The...",
    "url": "https://www.romania-insider.com/costa-cruises-expansion-romania-feb-2026",
    "source": "Romania Insider",
    "category": "Romania",
    "date": "February 12, 2026"
  },
  {
    "title": "Greece Unveils its Tourism Strategy Focuses on Sustainable Growth, Market Diversification, and Year-Round Tourism to Drive Regional Development and Global Impact",
    "summary": "Greece Unveils its Tourism Strategy Focuses on Sustainable Growth, Market Diversification, and Year-Round Tourism to Drive Regional Development and Global Impact Greece Unveils its tourism strategy emphasizes...",
    "url": "https://www.travelandtourworld.com/news/article/greece-unveils-its-tourism-strategy-focuses-on-sustainable-growth-market-diversification-and-year-round-tourism-to-drive-regional-development-and-global-impact/",
    "source": "Travel & Tour World",
    "category": "European Tourism",
    "date": "February 12, 2026"
  },
  {
    "title": "Saudi Arabia Should Become the World’s Most Event-Friendly Country",
    "summary": "Saudi has been running the mass events experiment for centuries with pilgrimage and is now building on it with sports, music, and entertainment. It’s time to scale those lessons….and build a tourism strategy that...",
    "url": "https://skift.com/2026/02/12/saudi-arabia-should-become-the-worlds-most-event-friendly-country/",
    "source": "Skift",
    "category": "Global Travel",
    "date": "February 12, 2026"
  },
  {
    "title": "Weekend calendar: Il Cinema Ritrovato on Tour, tourism fair, concerts, exhibitions",
    "summary": "Classic Italian cinema and a Tarantino retrospective are part of the weekend’s offer in Bucharest, where the exhibition focused on the traditional Romanian blouse ia has been extended. In Bucharest: Il Cinema...",
    "url": "https://www.romania-insider.com/weekend-calendar-feb-12-2026",
    "source": "Romania Insider",
    "category": "Romania",
    "date": "February 12, 2026"
  },
  {
    "title": "Mega Baltic Sea Resort Set to Open in 2026 as Industry Debates Future of Coastal Tourism",
    "summary": "A massive new Baltic Sea resort in Poland, expected to open in 2026, is raising concerns among German Ostsee hoteliers. With 1,200 rooms, year-round entertainment, and competitive pricing, the project highlights...",
    "url": "https://eturbonews.com/baltic-mega-resort-opening-2026-ostsee-tourism-competition/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "February 12, 2026"
  },
  {
    "title": "Destination by Hyatt’s Everline Resort & Spa, Lake Tahoe Names Monica Hubert as New General Manager",
    "summary": "Everline Resort & Spa, Lake Tahoe has appointed veteran hospitality executive Monica Hubert as General Manager. Bringing more than 30 years of resort leadership experience, Hubert returns to Tahoe to lead operations...",
    "url": "https://eturbonews.com/destination-by-hyatt-everline-resort-spa-lake-tahoe-monica-hubert-general-manager/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "February 11, 2026"
  }
]