[
  {
    "title": "Two Ways to Celebrate Love at Radisson Blu Hotel, Bucharest",
    "summary": "Love is never just one thing: at Radisson Blu Hotel, Bucharest, Valentine’s Day is celebrated through two distinct experiences, each with its own rhythm, atmosphere, and interpretation of indulgence. On February 13,...",
    "url": "https://www.romania-insider.com/two-ways-celebrate-love-radisson-blu-hotel-bucharest",
    "source": "Romania Insider",
    "category": "Romania",
    "date": "February 10, 2026"
  },
  {
    "title": "Scotland Opens a Resort Dedicated to Whisky — Surprisingly, It’s Not About Getting Drunk",
    "summary": "Scotland’s Speyside is preparing to welcome the world’s first luxury whisky resort, blending distilling heritage with high-end hospitality. Far from a drinking playground, the resort focuses on culture,...",
    "url": "https://eturbonews.com/scotland-world-first-luxury-whisky-resort-speyside/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "February 09, 2026"
  },
  {
    "title": "Bad Bunny Brought Buzz — Can Discover Puerto Rico Turn It Into Bookings?",
    "summary": "How do you measure the value of an organic cultural moment you can’t buy? Puerto Rico’s DMO just ran the experiment.",
    "url": "https://skift.com/2026/02/10/bad-bunny-brought-buzz-can-discover-puerto-rico-turn-it-into-bookings/",
    "source": "Skift",
    "category": "Global Travel",
    "date": "February 10, 2026"
  },
  {
    "title": "OpenAI Launches Ads Pilot for ChatGPT, Travel Expected to Participate",
    "summary": "OpenAI has crossed the advertising threshold. ChatGPT is now a potential marketing channel for travel brands — one that could surface hotel and flight ads at the exact moment a traveler is planning a trip inside a...",
    "url": "https://skift.com/2026/02/09/openai-chatgpt-ad-pilot-launch-travel/",
    "source": "Skift",
    "category": "Romania",
    "date": "February 09, 2026"
  },
  {
    "title": "WTTC Warns UK Tourism Levies Could Undermine Growth, Jobs and Global Competitiveness",
    "summary": "London, UK — As the UK government moves ahead with plans to give local authorities the power to impose levies on overnight stays, the World Travel & Tourism Council (WTTC) has sounded the alarm that these new charges...",
    "url": "https://eturbonews.com/wttc-uk-tourism-levies-impact-travel-growth/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "February 10, 2026"
  },
  {
    "title": "Jamaica to Lead Global Tourism Resilience Talks at GTRCMC Conference in Kenya",
    "summary": "Jamaica's Tourism Minister Edmund Bartlett underscored the urgency of preparedness as global risks intensify, declaring that “ Resilience is the New Tourism Currency .” He emphasized that destinations able to...",
    "url": "https://eturbonews.com/jamaica-global-tourism-resilience-bartlett-new-tourism-currency/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "February 10, 2026"
  },
  {
    "title": "Budget Hotels Are Struggling. Wyndham’s CEO Sees Opportunity",
    "summary": "Wyndham holds about 30% of all U.S. branded economy hotels. CEO Geoff Ballotti said in an exclusive Skift interview that he's optimistic for the budget segment, despite the recent cost and demand pressures it's faced.",
    "url": "https://skift.com/2026/02/09/budget-hotels-are-struggling-wyndhams-ceo-sees-opportunity/",
    "source": "Skift",
    "category": "Romania",
    "date": "February 09, 2026"
  },
  {
    "title": "The Dean Berlin Opens",
    "summary": "The Dean makes its German debut with the opening of The Dean Berlin, an 81-room lifestyle hotel in Charlottenburg. Housed in a late-19th-century building, the design-led property blends bold interiors, curated art...",
    "url": "https://eturbonews.com/the-dean-berlin-now-open/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "February 10, 2026"
  },
  {
    "title": "Fuel Crisis Grounds Flights to Cuba, Straining Tourism and Small Businesses — Can Jamaica or the Cayman Islands Step In?",
    "summary": "As jet fuel shortages force airline cancellations to Cuba, tourism and small businesses suffer. Regional neighbors Jamaica and the Cayman Islands emerge as potential refueling hubs—raising questions about resilience,...",
    "url": "https://eturbonews.com/fuel-crisis-cuba-flights-tourism-jamaica-cayman-islands/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "February 10, 2026"
  }
]