[
  {
    "title": "Two Ways to Celebrate Love at Radisson Blu Hotel, Bucharest",
    "summary": "Love is never just one thing: at Radisson Blu Hotel, Bucharest, Valentine’s Day is celebrated through two distinct experiences, each with its own rhythm, atmosphere, and interpretation of indulgence. On February 13,...",
    "url": "https://www.romania-insider.com/two-ways-celebrate-love-radisson-blu-hotel-bucharest",
    "source": "Romania Insider",
    "category": "Romania",
    "date": "February 10, 2026"
  },
  {
    "title": "Spanish Investors to Triple Excellence Oyster Bay Room Count, Expand Tourism Investment in Jamaica",
    "summary": "Spanish investors behind the luxury adults-only Excellence Oyster Bay will triple the resort’s room count over the next decade, beginning with expanded beach bungalows by 2026, while committing to workforce training,...",
    "url": "https://eturbonews.com/spanish-investors-triple-excellence-oyster-bay-jamaica/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "February 10, 2026"
  },
  {
    "title": "Bad Bunny Brought Buzz — Can Discover Puerto Rico Turn It Into Bookings?",
    "summary": "How do you measure the value of an organic cultural moment you can’t buy? Puerto Rico’s DMO just ran the experiment.",
    "url": "https://skift.com/2026/02/10/bad-bunny-brought-buzz-can-discover-puerto-rico-turn-it-into-bookings/",
    "source": "Skift",
    "category": "Global Travel",
    "date": "February 10, 2026"
  },
  {
    "title": "Romania among last EU countries in Transparency International’s Corruption Perceptions Index",
    "summary": "Romania obtained 45 points in the Corruption Perceptions Index 2025 , below the average of fragile democracies, which stands at 47 points, according to the report released on Tuesday, February 10, by the...",
    "url": "https://www.romania-insider.com/romania-transparency-international-corruption-perceptions-index-feb-2026",
    "source": "Romania Insider",
    "category": "Romania",
    "date": "February 10, 2026"
  },
  {
    "title": "Scotland Opens a Resort Dedicated to Whisky — Surprisingly, It’s Not About Getting Drunk",
    "summary": "Scotland’s Speyside is preparing to welcome the world’s first luxury whisky resort, blending distilling heritage with high-end hospitality. Far from a drinking playground, the resort focuses on culture,...",
    "url": "https://eturbonews.com/scotland-world-first-luxury-whisky-resort-speyside/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "February 09, 2026"
  },
  {
    "title": "Jamaica to Lead Global Tourism Resilience Talks at GTRCMC Conference in Kenya",
    "summary": "Jamaica's Tourism Minister Edmund Bartlett underscored the urgency of preparedness as global risks intensify, declaring that “ Resilience is the New Tourism Currency .” He emphasized that destinations able to...",
    "url": "https://eturbonews.com/jamaica-global-tourism-resilience-bartlett-new-tourism-currency/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "February 10, 2026"
  },
  {
    "title": "Paris hosts Roma slavery commemoration this month, Bucharest event due in November",
    "summary": "A commemoration marking 170 years since the abolition of Roma slavery in the Romanian Principalities will take place in Paris on February 20, bringing renewed attention to one of Europe’s longest and least...",
    "url": "https://www.romania-insider.com/roma-commemoration-paris-bucharest-2026",
    "source": "Romania Insider",
    "category": "Romania",
    "date": "February 10, 2026"
  },
  {
    "title": "Emirates, ANA, Cathay Pacific, Qatar Airways, Singapore Airlines, and British Airways Increase Flights to Taiwan as Michelin Key Hotels Like Mandarin Oriental Attract Luxury Tourists!",
    "summary": "Emirates, ANA, Cathay Pacific, Qatar Airways, Singapore Airlines, and British Airways Increase Flights to Taiwan as Michelin Key Hotels Like Mandarin Oriental Attract Luxury Tourists! Emirates, ANA, and Cathay...",
    "url": "https://www.travelandtourworld.com/news/article/emirates-ana-cathay-pacific-qatar-airways-singapore-airlines-and-british-airways-increase-flights-to-taiwan-as-michelin-key-hotels-like-mandarin-oriental-attract-luxury-tourists/",
    "source": "Travel & Tour World",
    "category": "European Tourism",
    "date": "February 11, 2026"
  },
  {
    "title": "Fuel Crisis Grounds Flights to Cuba, Straining Tourism and Small Businesses — Can Jamaica or the Cayman Islands Step In?",
    "summary": "As jet fuel shortages force airline cancellations to Cuba, tourism and small businesses suffer. Regional neighbors Jamaica and the Cayman Islands emerge as potential refueling hubs—raising questions about resilience,...",
    "url": "https://eturbonews.com/fuel-crisis-cuba-flights-tourism-jamaica-cayman-islands/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "February 10, 2026"
  }
]