[
  {
    "title": "H World Group Launches Hanting Inn as Economy Hotel Competition Intensifies in Price-Sensitive Markets",
    "summary": "H World Group has launched Hanting Inn, a new economy hotel brand designed to accelerate asset-light growth and convert existing properties into scalable accommodation. Targeting price-sensitive markets and...",
    "url": "https://eturbonews.com/h-world-group-launches-hanting-inn-economy-hotel-brand-expansion/",
    "source": "eTurboNews",
    "category": "Romania",
    "date": "February 11, 2026"
  },
  {
    "title": "Spanish Investors to Triple Excellence Oyster Bay Room Count, Expand Tourism Investment in Jamaica",
    "summary": "Spanish investors behind the luxury adults-only Excellence Oyster Bay will triple the resort’s room count over the next decade, beginning with expanded beach bungalows by 2026, while committing to workforce training,...",
    "url": "https://eturbonews.com/spanish-investors-triple-excellence-oyster-bay-jamaica/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "February 10, 2026"
  },
  {
    "title": "Destination by Hyatt’s Everline Resort & Spa, Lake Tahoe Names Monica Hubert as New General Manager",
    "summary": "Everline Resort & Spa, Lake Tahoe has appointed veteran hospitality executive Monica Hubert as General Manager. Bringing more than 30 years of resort leadership experience, Hubert returns to Tahoe to lead operations...",
    "url": "https://eturbonews.com/destination-by-hyatt-everline-resort-spa-lake-tahoe-monica-hubert-general-manager/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "February 11, 2026"
  },
  {
    "title": "Weekend calendar: Il Cinema Ritrovato on Tour, tourism fair, concerts, exhibitions",
    "summary": "Classic Italian cinema and a Tarantino retrospective are part of the weekend’s offer in Bucharest, where the exhibition focused on the traditional Romanian blouse ia has been extended. In Bucharest: Il Cinema...",
    "url": "https://www.romania-insider.com/weekend-calendar-feb-12-2026",
    "source": "Romania Insider",
    "category": "Romania",
    "date": "February 12, 2026"
  },
  {
    "title": "Why Pan Pacific London Keeps Winning Forbes Five-Star — A New Standard for City Luxury",
    "summary": "Pan Pacific London has secured its fifth consecutive Forbes Travel Guide Five-Star award, a rare achievement for a young luxury hotel. Blending Singaporean hospitality with wellness-focused design and intuitive...",
    "url": "https://eturbonews.com/pan-pacific-london-forbes-five-star-new-standard-city-luxury/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "February 11, 2026"
  },
  {
    "title": "Elkhart County, Indiana Set for Tourism Boom in 2026: New Hotels, Top Attractions, and Cultural Charm Await Travelers!",
    "summary": "Elkhart County, Indiana Set for Tourism Boom in 2026: New Hotels, Top Attractions, and Cultural Charm Await Travelers! Elkhart County’s top attractions, new hotel openings, and tourism growth for 2026 are explored....",
    "url": "https://www.travelandtourworld.com/news/article/elkhart-county-indiana-set-for-tourism-boom-in-2026-new-hotels-top-attractions-and-cultural-charm-await-travelers/",
    "source": "Travel & Tour World",
    "category": "Global Travel",
    "date": "February 12, 2026"
  },
  {
    "title": "Carrefour announces sale of Romanian operations to local group Pavǎl Holding",
    "summary": "Retail giant Carrefour announced on Thursday, February 12, that it entered into exclusive negotiations with local group Pavăl Holding (owners of Dedeman) for the sale of all its operations in Romania. The transaction...",
    "url": "https://www.romania-insider.com/carrefour-romania-sale-paval-holding-feb-2026",
    "source": "Romania Insider",
    "category": "Romania",
    "date": "February 12, 2026"
  },
  {
    "title": "WTTC Warns UK Tourism Levies Could Undermine Growth, Jobs and Global Competitiveness",
    "summary": "London, UK — As the UK government moves ahead with plans to give local authorities the power to impose levies on overnight stays, the World Travel & Tourism Council (WTTC) has sounded the alarm that these new charges...",
    "url": "https://eturbonews.com/wttc-uk-tourism-levies-impact-travel-growth/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "February 10, 2026"
  },
  {
    "title": "Jamaica to Lead Global Tourism Resilience Talks at GTRCMC Conference in Kenya",
    "summary": "Jamaica's Tourism Minister Edmund Bartlett underscored the urgency of preparedness as global risks intensify, declaring that “ Resilience is the New Tourism Currency .” He emphasized that destinations able to...",
    "url": "https://eturbonews.com/jamaica-global-tourism-resilience-bartlett-new-tourism-currency/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "February 10, 2026"
  }
]