[
  {
    "title": "Moldova Tourism: Europe’s Last Quiet Frontier and a Strategic Opportunity for Travel Professionals",
    "summary": "Moldova is Europe’s quiet frontier—an uncrowded wine, culture, and rural destination shaped by authenticity rather than mass tourism. Positioned between Ukraine and the EU, it offers travel professionals early-stage...",
    "url": "https://eturbonews.com/moldova-tourism-undiscovered-europe-destination/",
    "source": "eTurboNews",
    "category": "Romania",
    "date": "February 02, 2026"
  },
  {
    "title": "German Government Adopts New National Tourism Strategy to Boost Competitiveness and Sustainability",
    "summary": "Germany has adopted a new National Tourism Strategy, elevating tourism to a federal priority. The policy focuses on stronger coordination, modern infrastructure, reduced bureaucracy, digitalisation, workforce...",
    "url": "https://eturbonews.com/germany-national-tourism-strategy-competitiveness-sustainability/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "February 02, 2026"
  },
  {
    "title": "Japan and JICA Reaffirm Support for Sustainable Tourism Development in Palau",
    "summary": "On January 29, 2026, Japan International Cooperation Agency tourism expert ONODERA Mika met Japan’s Ambassador KASAHARA Kenichi in Palau to discuss advancing sustainable tourism. Talks highlighted Palau’s...",
    "url": "https://eturbonews.com/japan-jica-sustainable-tourism-development-palau/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "February 02, 2026"
  },
  {
    "title": "Chalet Doubles Down on Premium Hospitality With Athiva Expansion",
    "summary": "Chalet’s Athiva push shows how Indian hotel operators are using rebranding and pricing power and not just occupancy growth, to capture the country’s premium travel boom.",
    "url": "https://skift.com/2026/02/03/chalet-doubles-down-on-premium-hospitality-with-athiva-expansion/",
    "source": "Skift",
    "category": "Romania",
    "date": "February 04, 2026"
  },
  {
    "title": "Marriott Internationa Bets Big on Vietnam as Global Hotel Giants Battle for Market Share",
    "summary": "Marriott International is accelerating its expansion in Vietnam with a multi-property agreement amid intensifying global hotel competition. The U.S.-based hospitality giant faces growing pressure from European and...",
    "url": "https://eturbonews.com/marriott-vietnam-expansion-hotel-competition/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "February 03, 2026"
  },
  {
    "title": "Margaritaville Beach House Key West Names Alin Bodea General Manager",
    "summary": "Margaritaville Beach House Key West has appointed Alin Bodea as General Manager of its 186-room oceanfront resort on Smathers Beach. In his new role, Bodea will oversee day-to-day operations, lead the hospitality...",
    "url": "https://eturbonews.com/margaritaville-beach-house-key-west-appoints-alin-bodea-general-manager/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "February 03, 2026"
  },
  {
    "title": "Bucharest better connected with Scandinavian cities after Tarom signs codesharing agreement with SAS",
    "summary": "Tarom and Scandinavian Airlines (SAS) announced the launch of a codeshare commercial cooperation, a partnership that significantly expands travel options for passengers in Romania, according to press releases from...",
    "url": "https://www.romania-insider.com/tarom-sas-codeshare-february-2026",
    "source": "Romania Insider",
    "category": "Romania",
    "date": "February 04, 2026"
  },
  {
    "title": "Massive Discount on Five-Star Resort in Antalya, Turkey – What’s the Catch for Off-Season Travel?",
    "summary": "Massive Discount on Five-Star Resort in Antalya, Turkey – What’s the Catch for Off-Season Travel? Discover how a British traveller saved 72% on a five-star all-inclusive resort in Antalya, Turkey, by booking in...",
    "url": "https://www.travelandtourworld.com/news/article/massive-discount-on-five-star-resort-in-antalya-turkey-whats-the-catch-for-off-season-travel/",
    "source": "Travel & Tour World",
    "category": "European Tourism",
    "date": "February 04, 2026"
  },
  {
    "title": "Destinations International Opens Registration for New “Tourism for All” Certificate Program",
    "summary": "Destinations International has opened registration for its new Tourism for All certificate program, a six-month virtual cohort designed to help destination leaders build welcoming, community-centered tourism. The...",
    "url": "https://eturbonews.com/destinations-international-tourism-for-all-certificate-program/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "February 03, 2026"
  }
]