[
  {
    "title": "Moldova Tourism: Europe’s Last Quiet Frontier and a Strategic Opportunity for Travel Professionals",
    "summary": "Moldova is Europe’s quiet frontier—an uncrowded wine, culture, and rural destination shaped by authenticity rather than mass tourism. Positioned between Ukraine and the EU, it offers travel professionals early-stage...",
    "url": "https://eturbonews.com/moldova-tourism-undiscovered-europe-destination/",
    "source": "eTurboNews",
    "category": "Romania",
    "date": "February 02, 2026"
  },
  {
    "title": "German Government Adopts New National Tourism Strategy to Boost Competitiveness and Sustainability",
    "summary": "Germany has adopted a new National Tourism Strategy, elevating tourism to a federal priority. The policy focuses on stronger coordination, modern infrastructure, reduced bureaucracy, digitalisation, workforce...",
    "url": "https://eturbonews.com/germany-national-tourism-strategy-competitiveness-sustainability/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "February 02, 2026"
  },
  {
    "title": "Japan and JICA Reaffirm Support for Sustainable Tourism Development in Palau",
    "summary": "On January 29, 2026, Japan International Cooperation Agency tourism expert ONODERA Mika met Japan’s Ambassador KASAHARA Kenichi in Palau to discuss advancing sustainable tourism. Talks highlighted Palau’s...",
    "url": "https://eturbonews.com/japan-jica-sustainable-tourism-development-palau/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "February 02, 2026"
  },
  {
    "title": "Affordable second-hand cars most sought after by drivers in Romania in 2025",
    "summary": "In 2025, Romanian drivers turned to affordable second-hand cars when buying an automobile. Among the most favored car brands are Volkswagen, Dacia, and BMW. In total, more than 548,600 passenger cars were registered...",
    "url": "https://www.romania-insider.com/second-hand-cars-drivers-romania-2025",
    "source": "Romania Insider",
    "category": "Romania",
    "date": "February 02, 2026"
  },
  {
    "title": "World Tourism Network to Host First ITB Berlin Networking Dinner on Eve of ITB 2026",
    "summary": "The World Tourism Network will host its first ITB Berlin Networking Dinner on March 2, 2026, at Alpha House. Organized with the International Institute for Peace Through Tourism , the African Tourism Board , and...",
    "url": "https://eturbonews.com/world-tourism-network-itb-berlin-networking-dinner-2026/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "February 01, 2026"
  },
  {
    "title": "JTB CEO Says Japan’s Tourism Problem Is Distribution, Not Overtourism",
    "summary": "Japan doesn’t have too many tourists. It has too many tourists being sent to the same places. Until that changes, talks on solving overtourism will just remain recycled rhetoric.",
    "url": "https://skift.com/2026/02/02/jtb-ceo-says-japans-tourism-problem-is-distribution-not-overtourism/",
    "source": "Skift",
    "category": "Global Travel",
    "date": "February 03, 2026"
  },
  {
    "title": "Romanian startups register record financing in 2025, signaling shift in the sector",
    "summary": "Romanian startups exceeded expectations in 2025, registering an influx of capital and signaling a shift in the local sector. The growth of last year was backed by international investors such as Atomico and Eurazeo....",
    "url": "https://www.romania-insider.com/romanian-startups-record-financing-2025",
    "source": "Romania Insider",
    "category": "Romania",
    "date": "February 02, 2026"
  },
  {
    "title": "WTTC Strengthens Strategic Partnership with Spain as Global Headquarters Opens in Madrid",
    "summary": "The decision to establish the World Travel & Tourism Council global headquarters in Spain followed sustained dialogue with the Ministry of Industry and Tourism of Spain , reflecting a shared vision to strengthen...",
    "url": "https://eturbonews.com/wttc-strengthens-partnership-with-spain-as-global-hq-is-established/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "February 02, 2026"
  },
  {
    "title": "What Makes Aravali Marriott Resort & Spa the New Must-Visit Destination in Delhi NCR",
    "summary": "What Makes Aravali Marriott Resort & Spa the New Must-Visit Destination in Delhi NCR Aravali Marriott Resort & Spa in Delhi NCR offers a nature-led experience with luxury accommodations, wellness facilities, and...",
    "url": "https://www.travelandtourworld.com/news/article/what-makes-aravali-marriott-resort-spa-the-new-must-visit-destination-in-delhi-ncr/",
    "source": "Travel & Tour World",
    "category": "Global Travel",
    "date": "February 03, 2026"
  }
]