[
  {
    "title": "U.S. Lawmakers Are Driving International Visitors Away – And Tourism Is Paying the Price",
    "summary": "Brand USA is being asked to promote a destination undermined by U.S. government policies on equality, funding, and border treatment. As Canadian and global travelers quietly turn away, eTurboNews calls on U.S....",
    "url": "https://eturbonews.com/us-lawmakers-driving-tourism-decline-brand-usa-crisis/",
    "source": "eTurboNews",
    "category": "Romania",
    "date": "February 05, 2026"
  },
  {
    "title": "Bulgarians Travel More, Farther, and Longer: How Destinations Can Win a Growing Market",
    "summary": "Despite having the EU’s lowest average disposable income, Bulgarians are traveling abroad more than ever. In 2026, they are choosing longer holidays, farther destinations, and increasingly cruises. For destinations,...",
    "url": "https://eturbonews.com/bulgarian-outbound-travel-market-2026/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "February 07, 2026"
  },
  {
    "title": "Antigua and Barbuda Puts Sustainability and People at the Center of Its 2026 Tourism Strategy",
    "summary": "Antigua and Barbuda has outlined a people-first tourism strategy for 2026, focusing on sustainable growth, major hotel investments, cruise expansion, and improved air access. Tourism Minister Charles Fernandez said...",
    "url": "https://eturbonews.com/antigua-barbuda-tourism-strategy-2026/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "February 04, 2026"
  },
  {
    "title": "Antigua and Barbuda Showcases Culture, Cuisine and 2026 Experiences at Leading UK Travel Exhibition",
    "summary": "The Antigua and Barbuda Tourism Authority showcased the twin-island destination at the Destinations: Holiday and Travel Show in London, engaging UK travellers with insights into 2026 events, vibrant culture and...",
    "url": "https://eturbonews.com/antigua-barbuda-tourism-authority-destinations-travel-show-london/",
    "source": "eTurboNews",
    "category": "Romania",
    "date": "February 05, 2026"
  },
  {
    "title": "TUI Mein Schiff Cruises Unveil Monopoly Edition for Mediterranean Voyages: What You Need to Know",
    "summary": "TUI Mein Schiff Cruises Unveil Monopoly Edition for Mediterranean Voyages: What You Need to Know TUI Cruises launches Monopoly edition on Mein Schiff for Mediterranean and Caribbean routes, enhancing onboard tourism...",
    "url": "https://www.travelandtourworld.com/news/article/tui-mein-schiff-cruises-unveil-monopoly-edition-for-mediterranean-voyages/",
    "source": "Travel & Tour World",
    "category": "European Tourism",
    "date": "February 08, 2026"
  },
  {
    "title": "Set Sail to the Caribbean’s Best Destinations with Ambassador Cruise Line’s Ambience, Here’s All You Need to Know",
    "summary": "Set Sail to the Caribbean’s Best Destinations with Ambassador Cruise Line’s Ambience, Here’s All You Need to Know Ambassador Cruise Line’s Ambience embarks on a 40-day Caribbean cruise with exclusive stops in Cuba,...",
    "url": "https://www.travelandtourworld.com/news/article/set-sail-to-the-caribbeans-best-destinations-with-ambassador-cruise-lines-ambience-heres-all-you-need-to-know/",
    "source": "Travel & Tour World",
    "category": "Global Travel",
    "date": "February 08, 2026"
  },
  {
    "title": "Wizz Air carries 14.5 million passengers in Romania in 2025 as local operations expand",
    "summary": "Wizz Air transported around 14.5 million passengers to and from Romania in 2025, up 13.1% compared to the previous year, as the airline strengthened its presence on the local market. According to the company, Romania...",
    "url": "https://www.romania-insider.com/wizz-air-passengers-romania-2025",
    "source": "Romania Insider",
    "category": "Romania",
    "date": "February 06, 2026"
  },
  {
    "title": "Private Healthcare Costs in Southeast Asia: A Practical Comparison for Travelers",
    "summary": "Southeast Asia offers travelers a wide spectrum of private healthcare costs, from Singapore’s premium pricing to highly affordable routine care in Vietnam, Cambodia, and Laos. With health check-ups ranging from under...",
    "url": "https://eturbonews.com/southeast-asia-private-healthcare-costs/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "February 06, 2026"
  },
  {
    "title": "Cashless Tourism: When Convenience Shapes Who Can Travel—and Who Cannot",
    "summary": "As tourism goes cashless, convenience rises—but so do barriers. Travelers from cash-based countries, families, and small businesses face exclusion, higher fees, and lost flexibility. For many visitors, payment rules...",
    "url": "https://eturbonews.com/cashless-tourism-global-impact-travelers-small-businesses/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "February 07, 2026"
  }
]