[
  {
    "title": "OpenAI Launches Ads Pilot for ChatGPT, Travel Expected to Participate",
    "summary": "OpenAI has crossed the advertising threshold. ChatGPT is now a potential marketing channel for travel brands — one that could surface hotel and flight ads at the exact moment a traveler is planning a trip inside a...",
    "url": "https://skift.com/2026/02/09/openai-chatgpt-ad-pilot-launch-travel/",
    "source": "Skift",
    "category": "Romania",
    "date": "February 09, 2026"
  },
  {
    "title": "Scotland Opens a Resort Dedicated to Whisky — Surprisingly, It’s Not About Getting Drunk",
    "summary": "Scotland’s Speyside is preparing to welcome the world’s first luxury whisky resort, blending distilling heritage with high-end hospitality. Far from a drinking playground, the resort focuses on culture,...",
    "url": "https://eturbonews.com/scotland-world-first-luxury-whisky-resort-speyside/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "February 09, 2026"
  },
  {
    "title": "Msheireb Downtown Doha Concludes Successful Winter Season with Five Million Visits, Cementing its Role in Tourism Growth and Hospitality Future in Qatar",
    "summary": "Msheireb Downtown Doha Concludes Successful Winter Season with Five Million Visits, Cementing its Role in Tourism Growth and Hospitality Future in Qatar Msheireb Downtown Doha ends its winter season with 5 million...",
    "url": "https://www.travelandtourworld.com/news/article/msheireb-downtown-doha-concludes-successful-winter-season-with-five-million-visits-cementing-its-role-in-tourism-growth-and-hospitality-future-in-qatar/",
    "source": "Travel & Tour World",
    "category": "Global Travel",
    "date": "February 10, 2026"
  },
  {
    "title": "Budget Hotels Are Struggling. Wyndham’s CEO Sees Opportunity",
    "summary": "Wyndham holds about 30% of all U.S. branded economy hotels. CEO Geoff Ballotti said in an exclusive Skift interview that he's optimistic for the budget segment, despite the recent cost and demand pressures it's faced.",
    "url": "https://skift.com/2026/02/09/budget-hotels-are-struggling-wyndhams-ceo-sees-opportunity/",
    "source": "Skift",
    "category": "Romania",
    "date": "February 09, 2026"
  },
  {
    "title": "Europe vs. the USA in 2026: Why the “Trump Factor” Is Becoming a Real Tourism Liability",
    "summary": "As long-haul travel tightens in 2026, politics is no longer background noise. From renewed U.S. policy uncertainty to the fallout of the Trump Tower Belgrade controversy, the “Trump factor” is reshaping traveler...",
    "url": "https://eturbonews.com/europe-usa-travel-2026-trump-factor-tourism/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "February 09, 2026"
  },
  {
    "title": "One Thousand ALG Travel Advisors Sign-Up to Volunteer in Support of Jamaica",
    "summary": "Jamaica’s Minister of Tourism, Hon Edmund Bartlett, has warmly applauded the 1,000 travel advisors from Apple Leisure Group (ALG) who have signed up to participate in volunteer initiatives across the island,...",
    "url": "https://eturbonews.com/alg-travel-advisor-volunteer-for-jamaica/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "February 09, 2026"
  },
  {
    "title": "Sweden Joins Denmark, Ireland, Poland, Romania, and Luxembourg as Turkish Airlines Expands its Reach in Europe With New Localised Travel Platforms: Here’s What You Need To Know",
    "summary": "Sweden Joins Denmark, Ireland, Poland, Romania, and Luxembourg as Turkish Airlines Expands its Reach in Europe With New Localised Travel Platforms: Here’s What You Need To Know Sweden joins Denmark, Ireland, Poland,...",
    "url": "https://www.travelandtourworld.com/news/article/sweden-joins-denmark-ireland-poland-romania-and-luxembourg-as-turkish-airlines-expands-its-reach-in-europe-with-new-localised-travel-platforms-heres-what-you-need-to-know/",
    "source": "Travel & Tour World",
    "category": "Romania",
    "date": "February 10, 2026"
  },
  {
    "title": "Spain Dominates 2026 Skies: A Massive Flight Surge Outshines Europe’s Airports, Setting the Standard for Global Travel!",
    "summary": "Spain Dominates 2026 Skies: A Massive Flight Surge Outshines Europe’s Airports, Setting the Standard for Global Travel! Spain experiences a surge in long-haul and budget flights in 2026, boosting tourism and business...",
    "url": "https://www.travelandtourworld.com/news/article/spain-dominates-2026-skies-a-massive-flight-surge-outshines-europes-airports-setting-the-standard-for-global-travel/",
    "source": "Travel & Tour World",
    "category": "European Tourism",
    "date": "February 10, 2026"
  },
  {
    "title": "Flights to St Helena Suspended, Leaving Remote Island Cut Off Again",
    "summary": "Commercial flights to St Helena have been suspended after safety certification issues grounded the island’s only regular air service. Operated by Airlink , the route is a vital lifeline for residents, tourism, and...",
    "url": "https://eturbonews.com/st-helena-flights-suspended-airlink-airport-safety/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "February 09, 2026"
  }
]