[
  {
    "title": "Romanian IT deal: Zitec acquires Equilobe to accelerate international expansion",
    "summary": "Romanian IT and digital transformation company Zitec has acquired local technology firm Equilobe in a strategic move aimed at accelerating its international expansion, particularly in Western Europe. According to...",
    "url": "https://www.romania-insider.com/zitec-equilobe-deal-romania-feb-2026",
    "source": "Romania Insider",
    "category": "Romania",
    "date": "February 13, 2026"
  },
  {
    "title": "Epic Presidents Day Cruise Deals 2026: Unlock Luxury Cabins, Onboard Credits, and Family-Friendly Savings Across Global Destinations",
    "summary": "Epic Presidents Day Cruise Deals 2026: Unlock Luxury Cabins, Onboard Credits, and Family-Friendly Savings Across Global Destinations Discover 2026 Presidents Day Cruise Deals with huge savings on Caribbean, European,...",
    "url": "https://www.travelandtourworld.com/news/article/epic-presidents-day-cruise-deals-2026-unlock-luxury-cabins-onboard-credits-and-family-friendly-savings-across-global-destinations/",
    "source": "Travel & Tour World",
    "category": "European Tourism",
    "date": "February 14, 2026"
  },
  {
    "title": "Mozambique Goes Digital: New e-Visa Platform Signals a Forward-Looking Tourism Strategy",
    "summary": "Mozambique’s new e-Visa platform opens digital access to travellers from 183 countries, signalling a bold step toward modern tourism and investment. By simplifying entry while strengthening security and...",
    "url": "https://eturbonews.com/mozambique-new-evisa-platform-tourism-access-africa/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "February 13, 2026"
  },
  {
    "title": "Prism Pushes Into Europe With Hotels as IPO Nears",
    "summary": "Prism has Belvilla's presence and the brandscape. Now, all it needs to do is replicate the UK's success in Germany and it's got a scalable international model, too.",
    "url": "https://skift.com/2026/02/13/prism-pushes-into-europe-with-hotels-as-ipo-nears/",
    "source": "Skift",
    "category": "Romania",
    "date": "February 13, 2026"
  },
  {
    "title": "Air Tahiti Nui Appoints Lionel Guérin as CEO to Lead New Strategic Transformation",
    "summary": "Air Tahiti Nui has appointed aviation veteran Lionel Guérin as CEO, signaling a new strategic phase for French Polynesia’s flagship carrier. The leadership change comes as the long-haul airline faces growing...",
    "url": "https://eturbonews.com/air-tahiti-nui-ceo-lionel-guerin-appointment-strategy-transformation/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "February 12, 2026"
  },
  {
    "title": "Russian Outbound Tourism Defies Isolation: Can Travel Become a Bridge for Peace While War Continues?",
    "summary": "Russian outbound tourism is rebounding strongly despite global political isolation over the Ukraine war. With billions spent abroad, travelers from Russia and Ukraine now share holidays in neutral destinations like...",
    "url": "https://eturbonews.com/russian-outbound-tourism-resilience-war-ukraine-peace-travel/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "February 14, 2026"
  },
  {
    "title": "Expedia’s B2B Surge Buys Time for Vrbo and Hotels.com",
    "summary": "Expedia's B2B division is growing nearly five times faster than its consumer brands. That gap buys time for the Vrbo and Hotels.com turnaround — but 2026 will test whether efficiency gains can translate into...",
    "url": "https://skift.com/2026/02/12/expedia-q4-2025-earnings-b2b-b2c/",
    "source": "Skift",
    "category": "Romania",
    "date": "February 13, 2026"
  },
  {
    "title": "Mega Baltic Sea Resort Set to Open in 2026 as Industry Debates Future of Coastal Tourism",
    "summary": "A massive new Baltic Sea resort in Poland, expected to open in 2026, is raising concerns among German Ostsee hoteliers. With 1,200 rooms, year-round entertainment, and competitive pricing, the project highlights...",
    "url": "https://eturbonews.com/baltic-mega-resort-opening-2026-ostsee-tourism-competition/",
    "source": "eTurboNews",
    "category": "European Tourism",
    "date": "February 12, 2026"
  },
  {
    "title": "Hong Kong Tourism Board Opens First MICE Visitor Centre at HKCEC, Following Global Convention Trends",
    "summary": "The Hong Kong Tourism Board (HKTB) has launched a new Visitor Service Centre at the Hong Kong Convention and Exhibition Centre (HKCEC), positioning itself in line with a growing global trend where tourism boards...",
    "url": "https://eturbonews.com/hong-kong-tourism-board-opens-first-mice-visitor-centre-at-hkcec-following-global-convention-trends/",
    "source": "eTurboNews",
    "category": "Global Travel",
    "date": "February 12, 2026"
  }
]